[
    {
        "rule_id": "PCAOB-1000",
        "standard": "AS 1000 - General Responsibilities of the Auditor in Conducting an Audit",
        "description": "Establishes the auditor's responsibilities in planning and performing an audit of financial statements in accordance with PCAOB standards.",
        "enforcement_guidelines": [
            "Understand the entity and its environment, including its internal control.",
            "Identify and assess risks of material misstatement, whether due to error or fraud.",
            "Design and perform audit procedures responsive to the assessed risks.",
            "Obtain sufficient appropriate audit evidence to support the auditor's opinion.",
            "Maintain independence and objectivity throughout the audit process."
        ]
    },
    {
        "rule_id": "PCAOB-1101",
        "standard": "AS 1101 - Audit Risk",
        "description": "Requires the auditor to identify and assess risks of material misstatement in the financial statements.",
        "enforcement_guidelines": [
            "Identify and assess risks of material misstatement, including the risk of management override of controls.",
            "Design and perform audit procedures to address the assessed risks.",
            "Document the identification, assessment, and response to risks of material misstatement."
        ]
    },
    {
        "rule_id": "PCAOB-1105",
        "standard": "AS 1105 - Audit Evidence",
        "description": "Sets forth the auditor's responsibility to obtain sufficient appropriate audit evidence to support the auditor's opinion.",
        "enforcement_guidelines": [
            "Obtain sufficient appropriate audit evidence to support the auditor's opinion.",
            "Evaluate the sufficiency and appropriateness of the audit evidence obtained.",
            "Document the audit evidence obtained and the conclusions reached."
        ]
    },
    {
        "rule_id": "PCAOB-1000-03",
        "standard": "AS 1000 - General Responsibilities of the Auditor in Conducting an Audit",
        "description": "The objectives of the auditor are to obtain reasonable assurance about the financial statements and internal control over financial reporting, and to communicate externally in accordance with applicable requirements.",
        "enforcement_guidelines": [
            "Obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud.",
            "Issue an auditor's report expressing an opinion on the financial statements or internal control over financial reporting.",
            "Communicate externally in accordance with applicable professional and legal requirements."
        ]
    },
    {
        "rule_id": "PCAOB-1000-04",
        "standard": "AS 1000 - General Responsibilities of the Auditor in Conducting an Audit",
        "description": "The auditor must maintain independence in fact and appearance, satisfying independence criteria set out in PCAOB standards and SEC regulations.",
        "enforcement_guidelines": [
            "Ensure independence from the company under audit throughout the audit and professional engagement period.",
            "Satisfy independence criteria set out in PCAOB standards and SEC rules and regulations.",
            "Comply with applicable ethics requirements, including PCAOB ethics rules."
        ]
    },
    {
        "rule_id": "PCAOB-1000-09",
        "standard": "AS 1000 - General Responsibilities of the Auditor in Conducting an Audit",
        "description": "The auditor must exercise due professional care, including professional skepticism, in all matters related to the audit.",
        "enforcement_guidelines": [
            "Exercise due professional care in all matters related to the audit, including acting with reasonable care and diligence.",
            "Exercise professional skepticism by objectively evaluating evidence, remaining alert to conditions that may indicate misstatements, and not assuming management's honesty.",
            "Consider potential bias on the part of management and the auditor."
        ]
    },
    {
        "rule_id": "PCAOB-1000-12",
        "standard": "AS 1000 - General Responsibilities of the Auditor in Conducting an Audit",
        "description": "The auditor must exercise professional judgment in conducting the audit, applying relevant training, knowledge, and experience.",
        "enforcement_guidelines": [
            "Exercise professional judgment in the context of conducting an audit with due professional care.",
            "Apply relevant training, knowledge, and experience to make informed decisions and reach well-reasoned conclusions."
        ]
    },
    {
        "rule_id": "PCAOB-1000-13",
        "standard": "AS 1000 - General Responsibilities of the Auditor in Conducting an Audit",
        "description": "The auditor must plan and perform the audit to obtain sufficient appropriate audit evidence to obtain reasonable assurance and form an opinion.",
        "enforcement_guidelines": [
            "Plan and perform the audit to obtain sufficient appropriate audit evidence.",
            "Ensure the audit evidence supports the auditor's opinion on the financial statements or internal control over financial reporting.",
            "Comply with applicable professional and legal requirements in conducting the audit."
        ]
    },
    {
        "rule_id": "PCAOB-1000",
        "standard": "AS 1000 - General Responsibilities of the Auditor in Conducting an Audit",
        "description": "The auditor must prepare audit documentation and communicate externally in accordance with applicable requirements.",
        "enforcement_guidelines": [
            "Prepare audit documentation to support significant conclusions and facilitate planning, performance, and supervision of the audit.",
            "Communicate externally in accordance with applicable professional and legal requirements.",
            "Ensure the auditor's report contains the appropriate expressions of opinion or disclaimers as required by the circumstances."
        ]
    },
    {
        "rule_id": "PCAOB-1101",
        "standard": "AS 1101 - Audit Risk",
        "description": "The auditor must conduct the audit to reduce audit risk to an appropriately low level.",
        "enforcement_guidelines": [
            "Plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement due to error or fraud.",
            "Assess audit risk as a function of the risk of material misstatement and detection risk.",
            "Apply due professional care, including obtaining sufficient appropriate audit evidence to reduce audit risk to an appropriately low level."
        ]
    },
    {
        "rule_id": "PCAOB-1101",
        "standard": "AS 1101 - Audit Risk",
        "description": "This standard addresses the identification and assessment of risks of material misstatement in financial statements, including inherent risk, control risk, and detection risk.",
        "enforcement_guidelines": [
            "Assess the risks of material misstatement at both the financial statement level and the assertion level.",
            "Understand the company's environment and internal controls to identify risks of material misstatement.",
            "Design and perform audit procedures to address the assessed risks of material misstatement.",
            "Evaluate the effectiveness of the company's internal controls in preventing or detecting material misstatements."
        ]
    },
    {
        "rule_id": "PCAOB-1105",
        "standard": "AS 1105 - Audit Evidence",
        "description": "This standard establishes requirements for obtaining sufficient and appropriate audit evidence to support the auditor's opinion on the financial statements.",
        "enforcement_guidelines": [
            "Plan and perform audit procedures to obtain sufficient appropriate audit evidence.",
            "Evaluate the relevance and reliability of audit evidence obtained from both internal and external sources.",
            "Test the accuracy and completeness of information produced by the company for use as audit evidence.",
            "Document the evaluation of the sufficiency and appropriateness of audit evidence obtained."
        ]
    },
    {
        "rule_id": "PCAOB-1105-1",
        "standard": "AS 1105 - Audit Evidence",
        "description": "Requirements for selecting items for testing to obtain audit evidence.",
        "enforcement_guidelines": [
            "Selecting all items (100 percent examination) when appropriate.",
            "Selecting specific items based on specified characteristics.",
            "Using audit sampling to test a portion of the population."
        ]
    },
    {
        "rule_id": "PCAOB-1105-2",
        "standard": "AS 1105 - Audit Evidence",
        "description": "Guidelines for using the work of a company's specialist as audit evidence.",
        "enforcement_guidelines": [
            "Assess the specialist's knowledge, skill, and ability in the relevant field.",
            "Evaluate the relationship between the specialist and the company to ensure independence.",
            "Evaluate the work of the specialist to determine its sufficiency and appropriateness as audit evidence."
        ]
    },
    {
        "rule_id": "PCAOB-1105A5",
        "standard": "AS 1105 - Audit Evidence",
        "description": "Auditors must evaluate the work of company specialists, considering the significance of their work and the risk of material misstatement.",
        "enforcement_guidelines": [
            "Evaluate the data, significant assumptions, and methods used by the specialist.",
            "Assess the relevance and reliability of the specialist's work in relation to the relevant assertion.",
            "Obtain more persuasive evidence if the significance of the specialist's work, the risk of material misstatement, or the company's influence on the specialist's judgments increases."
        ]
    },
    {
        "rule_id": "PCAOB-1105B1",
        "standard": "AS 1105 - Audit Evidence",
        "description": "Auditors must obtain sufficient appropriate evidence regarding investee financial results when auditing equity method investments.",
        "enforcement_guidelines": [
            "Read available financial statements of the investee and the accompanying audit report, if any.",
            "Consider the investee's auditor's report and determine if it is satisfactory for the purpose of the audit.",
            "Perform additional procedures if additional evidence is needed, such as reviewing investor files, making inquiries of investor management, or evaluating subsequent events and transactions."
        ]
    },
    {
        "rule_id": "PCAOB-1105",
        "standard": "AS 1105 - Audit Evidence",
        "description": "Auditors must evaluate the work of the investee's auditor to ensure the sufficiency and appropriateness of audit evidence.",
        "enforcement_guidelines": [
            "Inquire about the professional reputation, standing, and independence of the investee's auditor.",
            "Visit the investee's auditor and discuss audit procedures and results.",
            "Review the audit program and working papers of the investee's auditor."
        ]
    },
    {
        "rule_id": "PCAOB-1110",
        "standard": "AS 1110 - Relationship of Auditing Standards to Quality Control Standards",
        "description": "Establishes the relationship between auditing standards and quality control standards for firms conducting audits.",
        "enforcement_guidelines": [
            "Adopt a system of quality control to ensure compliance with PCAOB standards.",
            "Ensure quality control policies and procedures are in place for audit engagements.",
            "Understand the relationship between auditing standards and quality control standards."
        ]
    },
    {
        "rule_id": "PCAOB-1201",
        "standard": "AS 1201 - Supervision of the Audit Engagement",
        "description": "Requires proper supervision of the audit engagement and the work of engagement team members.",
        "enforcement_guidelines": [
            "Inform engagement team members of their responsibilities.",
            "Direct engagement team members to bring significant issues to the attention of the engagement partner.",
            "Review the work of engagement team members to evaluate whether the work was performed as planned and supports the conclusions reached.",
            "Consider the nature of the company, the nature of the assigned work, risks of material misstatement, and the knowledge, skill, and ability of each engagement team member when determining the extent of supervision."
        ]
    },
    {
        "rule_id": "PCAOB-1201",
        "standard": "AS 1201 - Supervision of the Audit Engagement",
        "description": "This standard outlines the requirements for the lead auditor to supervise the work of other auditors and auditor-employed specialists in an audit engagement.",
        "enforcement_guidelines": [
            "Inform the other auditor in writing about the scope of work and instructions for the audit.",
            "Review the other auditor's written description of audit procedures and ensure they are performed in accordance with the lead auditor's instructions.",
            "Determine if changes to the other auditor's planned audit procedures are necessary and communicate them in writing.",
            "Obtain and review documentation provided by the other auditor to ensure compliance with PCAOB standards.",
            "Evaluate the work of the other auditor and determine if additional procedures are needed to address any issues.",
            "In multi-tiered audits, evaluate the first other auditor's supervision of the second other auditor's work and obtain necessary documentation.",
            "For auditor-employed specialists, inform them of their responsibilities and ensure their work is coordinated with the audit team.",
            "Review the specialist's report or documentation to ensure their work provides sufficient appropriate evidence.",
            "Perform additional procedures if the specialist's findings or conclusions are inconsistent with the audit evidence or understanding of the company."
        ]
    },
    {
        "rule_id": "PCAOB-1206",
        "standard": "AS 1206 - Dividing Responsibility for the Audit with Another Accounting Firm",
        "description": "Establishes requirements for lead auditors when dividing audit responsibility with referred-to auditors.",
        "enforcement_guidelines": [
            "Communicate with the referred-to auditor and ensure proper performance of audit procedures.",
            "Obtain written representations from the referred-to auditor regarding independence and licensing.",
            "Ensure the referred-to auditor meets all necessary qualifications and compliance with PCAOB standards.",
            "Take appropriate action if unable to divide responsibility, including performing additional procedures, qualifying the opinion, or withdrawing from the engagement.",
            "Clearly reference the referred-to auditor's work in the lead auditor's report, including their name, report, and the portion of financial statements they audited."
        ]
    },
    {
        "rule_id": "PCAOB-1206",
        "standard": "AS 1206 - Dividing Responsibility for the Audit with Another Accounting Firm",
        "description": "This standard outlines the responsibilities of the lead auditor when another accounting firm is involved in the audit of a company's financial statements. It specifies how the lead auditor should reference the work of the referred-to auditor in their report and the necessary procedures to ensure the integrity of the audit.",
        "enforcement_guidelines": [
            "Assess and respond to risks related to the referred-to auditor's work.",
            "Obtain and evaluate the referred-to auditor's report on the financial statements.",
            "Include specific language in the lead auditor's report regarding the referred-to auditor's work.",
            "Ensure proper reference to the referred-to auditor's work in the lead auditor's report."
        ]
    },
    {
        "rule_id": "PCAOB-1210",
        "standard": "AS 1210 - Using the Work of an Auditor-Engaged Specialist",
        "description": "This standard establishes requirements for auditors when using the work of a specialist engaged by the auditor's firm to assist in obtaining or evaluating audit evidence regarding a relevant assertion of a significant account or disclosure.",
        "enforcement_guidelines": [
            "Assess the specialist's knowledge, skill, ability, and objectivity in the particular field for the type of work under consideration.",
            "Ensure the specialist has a sufficient level of knowledge, skill, and ability to perform the type of work under consideration.",
            "Evaluate the specialist's objectivity, including any relationships between the specialist, their employer, and the company that could affect impartial judgment.",
            "Inform the specialist of their responsibilities, including the objectives of the work, the nature of the work to be performed, the degree of responsibility, and the requirement to provide a report or equivalent documentation describing the work performed, results, and findings."
        ]
    },
    {
        "rule_id": "PCAOB-1210",
        "standard": "AS 1210 - Using the Work of an Auditor-Engaged Specialist",
        "description": "Guidelines for auditors when using the work of specialists to ensure proper coordination and evaluation of their work.",
        "enforcement_guidelines": [
            "Ensure proper coordination between the specialist's work and the engagement team's work.",
            "Review the specialist's report or equivalent documentation to evaluate sufficiency and appropriateness of evidence.",
            "Perform additional procedures if the specialist's findings or conclusions appear to contradict relevant assertions or if the specialist's work does not provide sufficient appropriate evidence."
        ]
    },
    {
        "rule_id": "PCAOB-1215",
        "standard": "AS 1215 - Audit Documentation",
        "description": "Requirements for audit documentation to support the auditor's conclusions and facilitate review of the engagement's quality.",
        "enforcement_guidelines": [
            "Prepare audit documentation in sufficient detail to provide a clear understanding of its purpose, source, and conclusions reached.",
            "Document procedures performed, evidence obtained, and conclusions reached with respect to relevant financial statement assertions.",
            "Ensure documentation is organized to provide a clear link to significant findings or issues."
        ]
    },
    {
        "rule_id": "PCAOB-1215-04",
        "standard": "AS 1215 - Audit Documentation",
        "description": "Audit documentation must include the following content: identification of the items inspected, results of auditing procedures, and significant findings or issues.",
        "enforcement_guidelines": [
            "Document the identification of items inspected, including specific check numbers or other identifying characteristics.",
            "Record the results of auditing procedures, including any significant findings or issues.",
            "Maintain documentation of significant findings or issues, including any cross-references to supporting evidence."
        ]
    },
    {
        "rule_id": "PCAOB-1215-08",
        "standard": "AS 1215 - Audit Documentation",
        "description": "Significant findings or issues must be documented, including disagreements among engagement team members or with others consulted.",
        "enforcement_guidelines": [
            "Identify and document significant findings or issues, including any inconsistencies with final conclusions.",
            "Document disagreements among engagement team members or with others consulted, including the basis for final resolution.",
            "Include cross-references to supporting audit documentation as necessary."
        ]
    },
    {
        "rule_id": "PCAOB-1215-14",
        "standard": "AS 1215 - Audit Documentation",
        "description": "Audit documentation must be retained for seven years from the report release date or related dates.",
        "enforcement_guidelines": [
            "Retain audit documentation for seven years from the report release date.",
            "If no report is issued, retain documentation for seven years from the date fieldwork was substantially completed.",
            "Document any additions to audit documentation after the report release date, including the date, preparer, and reason for the addition."
        ]
    },
    {
        "rule_id": "PCAOB-1220-01",
        "standard": "AS 1220 - Engagement Quality Review",
        "description": "Specifies the applicability of the standard to audit engagements, reviews of interim financial information, and certain attestation engagements.",
        "enforcement_guidelines": [
            "Ensure the standard applies to audit engagements, reviews of interim financial information, and attestation engagements regarding compliance or exemption reports of brokers and dealers."
        ]
    },
    {
        "rule_id": "PCAOB-1220-02",
        "standard": "AS 1220 - Engagement Quality Review",
        "description": "Sets the objective of the engagement quality reviewer to evaluate significant judgments and conclusions in forming the overall conclusion and preparing the engagement report.",
        "enforcement_guidelines": [
            "Evaluate significant judgments and conclusions related to engagement planning, risk assessment, and audit responses."
        ]
    },
    {
        "rule_id": "PCAOB-1220-03",
        "standard": "AS 1220 - Engagement Quality Review",
        "description": "Defines the qualifications required for an engagement quality reviewer, including competence, independence, integrity, and objectivity.",
        "enforcement_guidelines": [
            "Ensure the reviewer is an associated person of a registered public accounting firm.",
            "Verify the reviewer's independence from the company and ability to perform the review with integrity and objectivity."
        ]
    },
    {
        "rule_id": "PCAOB-1220-09",
        "standard": "AS 1220 - Engagement Quality Review",
        "description": "Outlines the process for conducting an engagement quality review in an audit engagement.",
        "enforcement_guidelines": [
            "Evaluate significant judgments related to engagement planning, including consideration of recent engagement experience and risks.",
            "Assess the engagement team's response to significant risks, including fraud risks.",
            "Review documentation supporting conclusions on significant risks, identified misstatements, and control deficiencies.",
            "Confirm that the engagement team appropriately addressed independence and engagement completion documentation.",
            "Ensure the engagement report is appropriate and consistent with the conclusions reached."
        ]
    },
    {
        "rule_id": "PCAOB-1220-11",
        "standard": "AS 1220 - Engagement Quality Review",
        "description": "Requires the engagement quality reviewer to evaluate the sufficiency of engagement documentation in supporting the audit conclusions.",
        "enforcement_guidelines": [
            "Verify that documentation indicates appropriate responses to significant risks.",
            "Confirm that documentation supports the conclusions reached by the engagement team."
        ]
    },
    {
        "rule_id": "PCAOB-1220-12",
        "standard": "AS 1220 - Engagement Quality Review",
        "description": "Establishes the criteria for providing concurring approval of issuance by the engagement quality reviewer.",
        "enforcement_guidelines": [
            "Ensure the reviewer is not aware of any significant engagement deficiencies.",
            "Confirm that the engagement team obtained sufficient appropriate evidence.",
            "Verify that the engagement team reached appropriate conclusions on the subject matter.",
            "Ensure the engagement report is appropriate in the circumstances.",
            "Confirm the firm's independence from the client."
        ]
    },
    {
        "rule_id": "PCAOB-1220-13",
        "standard": "AS 1220 - Engagement Quality Review",
        "description": "Permission to use the engagement report is granted only after the engagement quality reviewer provides concurring approval of issuance.",
        "enforcement_guidelines": [
            "Obtain concurring approval of issuance from the engagement quality reviewer before granting permission to use the engagement report."
        ]
    },
    {
        "rule_id": "PCAOB-1220-14",
        "standard": "AS 1220 - Engagement Quality Review",
        "description": "The engagement quality reviewer must evaluate significant judgments and conclusions in forming the overall conclusion on the engagement and preparing the engagement report.",
        "enforcement_guidelines": [
            "Hold discussions with the engagement partner and other team members.",
            "Review documentation supporting the conclusions reached by the engagement team.",
            "Evaluate the materiality and disposition of identified misstatements."
        ]
    },
    {
        "rule_id": "PCAOB-1220-17",
        "standard": "AS 1220 - Engagement Quality Review",
        "description": "Concurring approval of issuance is provided only if the engagement quality reviewer is not aware of any significant engagement deficiencies.",
        "enforcement_guidelines": [
            "Perform a thorough review of the engagement to identify any significant deficiencies.",
            "Ensure that the engagement report is appropriate and that the firm maintains independence from the client."
        ]
    },
    {
        "rule_id": "PCAOB-1220-18",
        "standard": "AS 1220 - Engagement Quality Review",
        "description": "Permission to use the engagement report is granted only after the engagement quality reviewer provides concurring approval of issuance.",
        "enforcement_guidelines": [
            "Obtain concurring approval of issuance from the engagement quality reviewer before granting permission to use the engagement report."
        ]
    },
    {
        "rule_id": "PCAOB-1301-01",
        "standard": "AS 1301 - Communications with Audit Committees",
        "description": "The auditor must communicate with the audit committee regarding certain matters related to the audit and establish an understanding of the audit engagement terms.",
        "enforcement_guidelines": [
            "Discuss the responsibilities of the audit committee with respect to the audit.",
            "Obtain information from the audit committee relevant to the audit.",
            "Document the understanding of the audit engagement terms in an engagement letter."
        ]
    },
    {
        "rule_id": "PCAOB-1301",
        "standard": "AS 1301 - Communications with Audit Committees",
        "description": "This standard outlines the requirements for auditors to communicate effectively with audit committees regarding audit responsibilities, strategies, and significant findings.",
        "enforcement_guidelines": [
            "Communicate the auditor's responsibilities and obtain information relevant to the audit from the audit committee.",
            "Establish an understanding of the terms of the audit engagement with the audit committee and provide an engagement letter annually.",
            "Communicate an overview of the overall audit strategy, including timing and significant risks, to the audit committee.",
            "Provide the audit committee with timely observations arising from the audit that are significant to the financial reporting process.",
            "Communicate significant changes to the planned audit strategy or significant risks to the audit committee.",
            "Discuss with the audit committee any significant issues discussed with management in connection with the auditor's appointment or retention.",
            "Communicate to the audit committee significant accounting policies, critical accounting estimates, and significant unusual transactions.",
            "Evaluate and communicate the quality of the company's financial reporting, including the presentation of financial statements and related disclosures.",
            "Communicate any concerns regarding management's anticipated application of new accounting pronouncements that might significantly affect future financial reporting.",
            "Communicate to the audit committee any matters that are difficult or contentious and were consulted outside the engagement team."
        ]
    },
    {
        "rule_id": "PCAOB-1301-16",
        "standard": "AS 1301 - Communications with Audit Committees",
        "description": "Auditors must communicate concerns about significant auditing or accounting matters discussed with management to the audit committee.",
        "enforcement_guidelines": [
            "Identify concerns regarding significant auditing or accounting matters.",
            "Communicate concerns to the audit committee.",
            "Document the communication in audit work papers."
        ]
    },
    {
        "rule_id": "PCAOB-1301-17",
        "standard": "AS 1301 - Communications with Audit Committees",
        "description": "Auditors must communicate matters relating to the evaluation of the company's ability to continue as a going concern to the audit committee.",
        "enforcement_guidelines": [
            "Assess whether there is substantial doubt about the company's ability to continue as a going concern.",
            "Communicate conditions and events indicating substantial doubt to the audit committee.",
            "Discuss the basis for conclusions regarding substantial doubt with the audit committee."
        ]
    },
    {
        "rule_id": "PCAOB-1301-18",
        "standard": "AS 1301 - Communications with Audit Committees",
        "description": "Auditors must provide the audit committee with a schedule of uncorrected misstatements and discuss the immateriality of such misstatements.",
        "enforcement_guidelines": [
            "Prepare a schedule of uncorrected misstatements.",
            "Discuss the immateriality of uncorrected misstatements with the audit committee.",
            "Document the discussion in audit work papers."
        ]
    },
    {
        "rule_id": "PCAOB-1301-19",
        "standard": "AS 1301 - Communications with Audit Committees",
        "description": "Auditors must communicate corrected misstatements to the audit committee and discuss their implications.",
        "enforcement_guidelines": [
            "Identify corrected misstatements that are not clearly trivial.",
            "Communicate these misstatements to the audit committee.",
            "Discuss the implications of these misstatements with the audit committee."
        ]
    },
    {
        "rule_id": "PCAOB-1301-20",
        "standard": "AS 1301 - Communications with Audit Committees",
        "description": "Auditors must communicate other material written communications between the auditor and management to the audit committee.",
        "enforcement_guidelines": [
            "Identify material written communications between the auditor and management.",
            "Communicate these communications to the audit committee.",
            "Document the communication in audit work papers."
        ]
    },
    {
        "rule_id": "PCAOB-1301",
        "standard": "AS 1301 - Communications with Audit Committees",
        "description": "This standard outlines the requirements for auditors to communicate with audit committees regarding internal control deficiencies, material weaknesses, and significant deficiencies. It also specifies the responsibilities of management and the auditor in ensuring proper communication and documentation.",
        "enforcement_guidelines": [
            "Identify and assess material weaknesses and significant deficiencies in internal control over financial reporting.",
            "Communicate all material weaknesses and significant deficiencies to the audit committee and management in writing.",
            "Ensure that management provides a written confirmation of their understanding and responsibilities regarding internal control deficiencies.",
            "Document all communications with the audit committee and management in accordance with AS 1215, Audit Documentation.",
            "Review and update the audit engagement letter to reflect the responsibilities of the auditor and the company regarding internal control communication."
        ]
    },
    {
        "rule_id": "PCAOB-1305",
        "standard": "AS 1305 - Communications About Control Deficiencies in an Audit of Financial Statements",
        "description": "This standard establishes requirements for auditors to identify and communicate control deficiencies, including significant deficiencies and material weaknesses, in internal control over financial reporting.",
        "enforcement_guidelines": [
            "Identify and assess control deficiencies, distinguishing between significant deficiencies and material weaknesses.",
            "Communicate in writing to management and the audit committee all significant deficiencies and material weaknesses prior to the issuance of the auditor's report.",
            "Clearly distinguish between significant deficiencies and material weaknesses in written communications.",
            "Avoid reporting that no significant deficiencies were discovered due to the potential for misunderstanding the limited assurance associated with such a report.",
            "Communicate matters during the audit if timely communication is important, especially for significant or urgent issues."
        ]
    },
    {
        "rule_id": "PCAOB-2101",
        "standard": "AS 2101 - Audit Planning",
        "description": "This standard outlines the responsibilities of the lead auditor when planning an audit that involves other auditors or referred-to auditors. It emphasizes the importance of proper planning, including establishing the overall audit strategy and developing an audit plan.",
        "enforcement_guidelines": [
            "Determine compliance with SEC independence requirements and PCAOB independence and ethics requirements for each other auditor.",
            "Obtain a written affirmation from each other auditor regarding their compliance with independence and ethics requirements.",
            "Evaluate the knowledge, skill, and ability of the other auditor's engagement team members.",
            "Ensure that the lead auditor can communicate with the other auditor and gain access to the other auditor's audit documentation."
        ]
    },
    {
        "rule_id": "PCAOB-2101-10",
        "standard": "AS 2101 - Audit Planning",
        "description": "The auditor must develop and document an audit plan that includes risk assessment procedures, tests of controls, and other audit procedures.",
        "enforcement_guidelines": [
            "Develop and document an audit plan that includes risk assessment procedures.",
            "Include tests of controls and substantive procedures in the audit plan.",
            "Ensure the audit plan addresses all necessary audit procedures for compliance."
        ]
    },
    {
        "rule_id": "PCAOB-2101-11",
        "standard": "AS 2101 - Audit Planning",
        "description": "In multi-location engagements, the auditor must assess risks and determine audit procedures for each location.",
        "enforcement_guidelines": [
            "Assess risks of material misstatement for each location or business unit.",
            "Determine the nature, timing, and extent of audit procedures for each location.",
            "Correlate audit attention with the degree of risk associated with each location."
        ]
    },
    {
        "rule_id": "PCAOB-2101-15",
        "standard": "AS 2101 - Audit Planning",
        "description": "The auditor must modify the audit plan if circumstances change during the audit.",
        "enforcement_guidelines": [
            "Monitor for significant changes in circumstances during the audit.",
            "Modify the overall audit strategy and audit plan as necessary.",
            "Document any changes to the audit plan and the reasons for the changes."
        ]
    },
    {
        "rule_id": "PCAOB-2101-16",
        "standard": "AS 2101 - Audit Planning",
        "description": "The auditor must determine if specialized skill or knowledge is needed for the audit.",
        "enforcement_guidelines": [
            "Assess the need for specialized skill or knowledge for the audit.",
            "Ensure that individuals with the required expertise are involved in the audit.",
            "Evaluate the results of procedures performed by specialists to ensure they meet audit objectives."
        ]
    },
    {
        "rule_id": "PCAOB-2105",
        "standard": "AS 2105 - Consideration of Materiality in Planning and Performing an Audit",
        "description": "This standard establishes requirements for auditors to appropriately consider materiality in planning and performing audits, including the establishment of materiality levels and tolerable misstatement.",
        "enforcement_guidelines": [
            "Establish a materiality level for the financial statements as a whole, considering the company's circumstances.",
            "Evaluate whether certain accounts or disclosures may have misstatements that could influence the judgment of a reasonable investor due to qualitative factors.",
            "Determine tolerable misstatement for individual accounts or disclosures to reduce the probability of material misstatement of the financial statements.",
            "Reevaluate and adjust the materiality level or tolerable misstatement when circumstances change or additional information indicates a need for adjustment."
        ]
    },
    {
        "rule_id": "PCAOB-2105",
        "standard": "AS 2105 - Consideration of Materiality in Planning and Performing an Audit",
        "description": "Auditors must reevaluate materiality levels and adjust audit procedures if a lower amount is identified.",
        "enforcement_guidelines": [
            "Evaluate the impact of the lower materiality level on risk assessments and audit procedures.",
            "Modify the nature, timing, and extent of audit procedures as necessary.",
            "Consider the effect of the reevaluation on the assessment of internal control over financial reporting."
        ]
    },
    {
        "rule_id": "PCAOB-2110",
        "standard": "AS 2110 - Identifying and Assessing Risks of Material Misstatement",
        "description": "Auditors must perform risk assessment procedures to identify and assess risks of material misstatement.",
        "enforcement_guidelines": [
            "Perform risk assessment procedures to provide a reasonable basis for identifying and assessing risks of material misstatement.",
            "Obtain an understanding of the company's industry, regulatory environment, and other external factors.",
            "Understand the company's nature, objectives, strategies, and business risks."
        ]
    },
    {
        "rule_id": "PCAOB-2110A",
        "standard": "AS 2110 - Identifying and Assessing Risks of Material Misstatement",
        "description": "Auditors must understand the company's financial relationships with executive officers.",
        "enforcement_guidelines": [
            "Perform procedures to identify risks of material misstatement related to financial relationships with executive officers.",
            "Read employment and compensation contracts with executive officers.",
            "Review proxy statements and other relevant filings with regulatory agencies."
        ]
    },
    {
        "rule_id": "PCAOB-2110-11A",
        "standard": "AS 2110 - Identifying and Assessing Risks of Material Misstatement",
        "description": "In a divided-responsibility audit, the referred-to auditor should inquire of the lead auditor regarding matters significant to their audit.",
        "enforcement_guidelines": [
            "Inquire about transactions, adjustments, or other matters affecting the financial statements.",
            "Assess the impact of these matters on the referred-to auditor's audit.",
            "Document the findings and conclusions from the inquiry."
        ]
    },
    {
        "rule_id": "PCAOB-2110-12",
        "standard": "AS 2110 - Identifying and Assessing Risks of Material Misstatement",
        "description": "Evaluate the company's selection and application of accounting principles and related disclosures.",
        "enforcement_guidelines": [
            "Assess significant changes in accounting principles or policies.",
            "Evaluate the company's financial reporting competencies.",
            "Identify accounts requiring judgment in applying accounting principles."
        ]
    },
    {
        "rule_id": "PCAOB-2110-18",
        "standard": "AS 2110 - Identifying and Assessing Risks of Material Misstatement",
        "description": "Obtain an understanding of internal control over financial reporting to identify potential misstatements.",
        "enforcement_guidelines": [
            "Evaluate the design of relevant controls.",
            "Determine if controls have been implemented.",
            "Perform walkthroughs to confirm control effectiveness."
        ]
    },
    {
        "rule_id": "PCAOB-2110-23",
        "standard": "AS 2110 - Identifying and Assessing Risks of Material Misstatement",
        "description": "Assess the company's control environment, including management's philosophy and board oversight.",
        "enforcement_guidelines": [
            "Evaluate management's philosophy and operating style.",
            "Assess the board's oversight of financial reporting.",
            "Identify control deficiencies in the control environment."
        ]
    },
    {
        "rule_id": "PCAOB-2110-26",
        "standard": "AS 2110 - Identifying and Assessing Risks of Material Misstatement",
        "description": "Understand the company's risk assessment process for financial reporting risks.",
        "enforcement_guidelines": [
            "Identify risks relevant to financial reporting objectives.",
            "Assess the likelihood and significance of misstatements.",
            "Evaluate management's actions to address identified risks."
        ]
    },
    {
        "rule_id": "PCAOB-2110",
        "standard": "AS 2110 - Identifying and Assessing Risks of Material Misstatement",
        "description": "Auditors must obtain an understanding of the company's information system relevant to financial reporting and perform walkthroughs to assess risks of material misstatement.",
        "enforcement_guidelines": [
            "Obtain an understanding of the information system, including classes of transactions, procedures, accounting records, and period-end financial reporting processes.",
            "Understand how the company communicates financial reporting roles and responsibilities.",
            "Perform walkthroughs to understand the flow of transactions, evaluate control designs, and determine if controls are implemented.",
            "Use probing questions during walkthroughs to identify important points where controls may be missing or ineffective."
        ]
    },
    {
        "rule_id": "PCAOB-2110-01",
        "standard": "AS 2110 - Identifying and Assessing Risks of Material Misstatement",
        "description": "The key engagement team members should discuss the potential for material misstatement due to fraud, including the susceptibility of the company's financial statements to material misstatement through related party transactions, omission or presentation of incomplete or inaccurate disclosures, and management bias in accounting estimates.",
        "enforcement_guidelines": [
            "Conduct discussions among key engagement team members regarding the potential for material misstatement due to fraud.",
            "Identify and assess risks of material misstatement at the financial statement level and the assertion level.",
            "Evaluate the likelihood and magnitude of potential misstatement to assess the possibility of material misstatement."
        ]
    },
    {
        "rule_id": "PCAOB-2110-02",
        "standard": "AS 2110 - Identifying and Assessing Risks of Material Misstatement",
        "description": "The auditor should inquire of the audit committee, management, internal audit function, and others within the company about the risks of material misstatement, including fraud risks.",
        "enforcement_guidelines": [
            "Inquire of management regarding the company's process for identifying and responding to fraud risks, including any specific fraud risks identified and controls established to address them.",
            "Inquire of the audit committee regarding their oversight of fraud risks, including their knowledge of fraud, alleged fraud, or suspected fraud affecting the company.",
            "Inquire of internal audit personnel regarding their views about fraud risks, including their knowledge of fraud, alleged fraud, or suspected fraud affecting the company."
        ]
    },
    {
        "rule_id": "PCAOB-2110-03",
        "standard": "AS 2110 - Identifying and Assessing Risks of Material Misstatement",
        "description": "The auditor should identify and assess the risks of material misstatement at the financial statement level and the assertion level, including evaluating the likelihood and magnitude of potential misstatement.",
        "enforcement_guidelines": [
            "Identify risks of misstatement using information obtained from performing risk assessment procedures.",
            "Evaluate whether identified risks relate pervasively to the financial statements as a whole and potentially affect many assertions.",
            "Evaluate the types of potential misstatements that could result from the identified risks and the accounts, disclosures, and assertions that could be affected."
        ]
    },
    {
        "rule_id": "PCAOB-2110-1",
        "standard": "AS 2110 - Identifying and Assessing Risks of Material Misstatement",
        "description": "Identifying and assessing risks of material misstatement in financial statements.",
        "enforcement_guidelines": [
            "Evaluate risk factors such as size, susceptibility to misstatement, volume of activity, complexity, and accounting estimates.",
            "Consider the likelihood and potential magnitude of misstatements.",
            "Assess whether risks are fraud risks or related to significant unusual transactions."
        ]
    },
    {
        "rule_id": "PCAOB-2110-2",
        "standard": "AS 2110 - Identifying and Assessing Risks of Material Misstatement",
        "description": "Evaluating fraud risk factors in the context of financial statement audits.",
        "enforcement_guidelines": [
            "Identify fraud risk factors related to incentives, opportunities, and rationalizations for fraud.",
            "Consider how fraud could be perpetrated or concealed through incomplete or inaccurate disclosures.",
            "Presume fraud risk involving improper revenue recognition and evaluate related risks."
        ]
    },
    {
        "rule_id": "PCAOB-2110-3",
        "standard": "AS 2110 - Identifying and Assessing Risks of Material Misstatement",
        "description": "Determining significant risks of material misstatement.",
        "enforcement_guidelines": [
            "Evaluate quantitative and qualitative risk factors affecting the likelihood and magnitude of misstatements.",
            "Consider whether risks are fraud risks or related to recent developments, complex transactions, or significant unusual transactions.",
            "Assess the complexity or judgment in financial information recognition or measurement."
        ]
    },
    {
        "rule_id": "PCAOB-2110-4",
        "standard": "AS 2110 - Identifying and Assessing Risks of Material Misstatement",
        "description": "Evaluating controls addressing fraud and significant risks.",
        "enforcement_guidelines": [
            "Evaluate the design and implementation of controls addressing fraud risks and significant risks.",
            "Consider controls that prevent, deter, and detect fraud, including those addressing management override.",
            "Understand controls related to significant unusual transactions and their impact on financial statements."
        ]
    },
    {
        "rule_id": "PCAOB-2110-B5",
        "standard": "AS 2110 - Identifying and Assessing Risks of Material Misstatement",
        "description": "Auditors must understand how the company has responded to risks arising from information technology (IT).",
        "enforcement_guidelines": [
            "Obtain an understanding of the company's response to IT-related risks."
        ]
    },
    {
        "rule_id": "PCAOB-2110-B6",
        "standard": "AS 2110 - Identifying and Assessing Risks of Material Misstatement",
        "description": "When relying on manual controls, auditors must design procedures to test the consistency of their application.",
        "enforcement_guidelines": [
            "Design audit procedures to test the consistency of manual control application."
        ]
    },
    {
        "rule_id": "PCAOB-2201-01",
        "standard": "AS 2201 - An Audit of Internal Control Over Financial Reporting That Is Integrated with An Audit of Financial Statements",
        "description": "Establishes requirements for auditing internal control over financial reporting integrated with financial statement audits.",
        "enforcement_guidelines": [
            "Understand the company's internal control over financial reporting.",
            "Assess the effectiveness of internal controls."
        ]
    },
    {
        "rule_id": "PCAOB-2201-09",
        "standard": "AS 2201 - An Audit of Internal Control Over Financial Reporting That Is Integrated with An Audit of Financial Statements",
        "description": "Provides direction for planning the audit of internal control over financial reporting.",
        "enforcement_guidelines": [
            "Plan the audit to include understanding and testing of internal controls."
        ]
    },
    {
        "rule_id": "PCAOB-2201-21",
        "standard": "AS 2201 - An Audit of Internal Control Over Financial Reporting That Is Integrated with An Audit of Financial Statements",
        "description": "Guidance on using a top-down approach to identify and assess risks.",
        "enforcement_guidelines": [
            "Use a top-down approach to identify and assess risks of material misstatement."
        ]
    },
    {
        "rule_id": "PCAOB-2201-42",
        "standard": "AS 2201 - An Audit of Internal Control Over Financial Reporting That Is Integrated with An Audit of Financial Statements",
        "description": "Requirements for testing controls during the audit.",
        "enforcement_guidelines": [
            "Test controls to evaluate their effectiveness in preventing or detecting material misstatements."
        ]
    },
    {
        "rule_id": "PCAOB-2201-62",
        "standard": "AS 2201 - An Audit of Internal Control Over Financial Reporting That Is Integrated with An Audit of Financial Statements",
        "description": "Guidance on evaluating identified deficiencies in internal control.",
        "enforcement_guidelines": [
            "Evaluate the severity of identified control deficiencies.",
            "Determine the impact on the audit opinion."
        ]
    },
    {
        "rule_id": "PCAOB-2201-71",
        "standard": "AS 2201 - An Audit of Internal Control Over Financial Reporting That Is Integrated with An Audit of Financial Statements",
        "description": "Requirements for wrapping up the audit of internal control.",
        "enforcement_guidelines": [
            "Complete all necessary audit procedures.",
            "Prepare the final audit report."
        ]
    },
    {
        "rule_id": "PCAOB-2201-03",
        "standard": "AS 2201 - An Audit of Internal Control Over Financial Reporting That Is Integrated with An Audit of Financial Statements",
        "description": "The auditor's objective is to express an opinion on the effectiveness of the company's internal control over financial reporting. The auditor must plan and perform the audit to obtain appropriate evidence about the existence of material weaknesses.",
        "enforcement_guidelines": [
            "Plan and perform the audit to obtain evidence about the existence of material weaknesses.",
            "Assess the effectiveness of internal control over financial reporting as of the specified date.",
            "Consider whether material weaknesses exist even if financial statements are not materially misstated."
        ]
    },
    {
        "rule_id": "PCAOB-2201-04",
        "standard": "AS 2201 - An Audit of Internal Control Over Financial Reporting That Is Integrated with An Audit of Financial Statements",
        "description": "The auditor must comply with independence and ethics requirements as specified in AS 1000.",
        "enforcement_guidelines": [
            "Comply with independence and ethics requirements as specified in AS 1000.",
            "Ensure that the work of others used in the audit complies with the standards.",
            "Assess the competence and objectivity of persons whose work is used in the audit."
        ]
    },
    {
        "rule_id": "PCAOB-2201-24",
        "standard": "AS 2201 - An Audit of Internal Control Over Financial Reporting That Is Integrated with An Audit of Financial Statements",
        "description": "Entity-level controls include controls related to the control environment, management override, risk assessment processes, centralized processing, monitoring of results, and period-end financial reporting.",
        "enforcement_guidelines": [
            "Evaluate the control environment, including management's philosophy and operating style.",
            "Assess controls over management override, particularly for smaller companies.",
            "Review the company's risk assessment process and centralized processing systems.",
            "Monitor results of operations and the period-end financial reporting process."
        ]
    },
    {
        "rule_id": "PCAOB-2201-25",
        "standard": "AS 2201 - An Audit of Internal Control Over Financial Reporting That Is Integrated with An Audit of Financial Statements",
        "description": "The control environment is critical to effective internal control over financial reporting. The auditor must evaluate the control environment, including management's philosophy, integrity, and ethical values, as well as the board's oversight.",
        "enforcement_guidelines": [
            "Assess management's philosophy and operating style.",
            "Evaluate the integrity and ethical values of top management.",
            "Review the board's or audit committee's oversight of financial reporting and internal control."
        ]
    },
    {
        "rule_id": "PCAOB-2201-26",
        "standard": "AS 2201 - An Audit of Internal Control Over Financial Reporting That Is Integrated with An Audit of Financial Statements",
        "description": "The period-end financial reporting process is crucial for accurate financial statements. The auditor must evaluate this process, including transaction entry, journal entries, and financial statement preparation.",
        "enforcement_guidelines": [
            "Understand the procedures for entering transaction totals into the general ledger.",
            "Review the processes for recording journal entries and adjustments.",
            "Assess the controls over the preparation of financial statements and related disclosures."
        ]
    },
    {
        "rule_id": "PCAOB-2201-28",
        "standard": "AS 2201 - An Audit of Internal Control Over Financial Reporting That Is Integrated with An Audit of Financial Statements",
        "description": "Significant accounts and disclosures are identified based on their potential to cause material misstatements. Relevant assertions include existence, completeness, valuation, rights and obligations, and presentation.",
        "enforcement_guidelines": [
            "Identify significant accounts and disclosures based on qualitative and quantitative risk factors.",
            "Evaluate relevant assertions for each significant account or disclosure.",
            "Assess the likelihood of misstatements causing material inaccuracies in financial statements."
        ]
    },
    {
        "rule_id": "PCAOB-2201-34",
        "standard": "AS 2201 - An Audit of Internal Control Over Financial Reporting That Is Integrated with An Audit of Financial Statements",
        "description": "Understanding the flow of transactions and potential misstatements is essential for effective auditing. Walkthroughs are a key method for achieving this understanding.",
        "enforcement_guidelines": [
            "Perform walkthroughs to understand transaction flows and potential misstatement points.",
            "Question company personnel about their understanding of prescribed procedures.",
            "Combine walkthrough procedures with inquiry, observation, inspection, and re-performance of controls."
        ]
    },
    {
        "rule_id": "PCAOB-2201-39",
        "standard": "AS 2201 - An Audit of Internal Control Over Financial Reporting That Is Integrated with An Audit of Financial Statements",
        "description": "Auditors must test controls that address the assessed risk of misstatement. Testing should focus on controls that sufficiently address these risks, regardless of their classification.",
        "enforcement_guidelines": [
            "Identify controls that address the assessed risk of misstatement.",
            "Test controls that sufficiently address the risk, whether they are entity-level or transaction-level.",
            "Avoid testing redundant controls unless redundancy is a control objective."
        ]
    },
    {
        "rule_id": "PCAOB-2201-01",
        "standard": "AS 2201 - An Audit of Internal Control Over Financial Reporting That Is Integrated with An Audit of Financial Statements",
        "description": "The auditor must test the design effectiveness of controls to ensure they can prevent or detect errors or fraud that could lead to material misstatements.",
        "enforcement_guidelines": [
            "Determine if controls, when operated as prescribed, satisfy control objectives.",
            "Perform procedures including inquiry, observation, and inspection of documentation."
        ]
    },
    {
        "rule_id": "PCAOB-2201-02",
        "standard": "AS 2201 - An Audit of Internal Control Over Financial Reporting That Is Integrated with An Audit of Financial Statements",
        "description": "The auditor must test the operating effectiveness of controls to ensure they are functioning as designed and are effective.",
        "enforcement_guidelines": [
            "Assess if controls are operating as designed.",
            "Evaluate the competence of personnel performing the controls.",
            "Perform procedures including inquiry, observation, inspection, and re-performance."
        ]
    },
    {
        "rule_id": "PCAOB-2201-03",
        "standard": "AS 2201 - An Audit of Internal Control Over Financial Reporting That Is Integrated with An Audit of Financial Statements",
        "description": "The auditor must evaluate identified control deficiencies to determine if they constitute material weaknesses.",
        "enforcement_guidelines": [
            "Assess the severity of each deficiency.",
            "Determine if deficiencies, individually or collectively, could result in a material misstatement.",
            "Consider factors such as the nature of accounts involved, susceptibility to fraud, and the interaction with other controls."
        ]
    },
    {
        "rule_id": "PCAOB-0066",
        "standard": "AS 2201 - An Audit of Internal Control Over Financial Reporting That Is Integrated with An Audit of Financial Statements",
        "description": "Evaluating the severity of control deficiencies and their potential to result in a material misstatement.",
        "enforcement_guidelines": [
            "Identify and assess the interaction of control deficiencies.",
            "Evaluate the potential future consequences of the deficiencies."
        ]
    },
    {
        "rule_id": "PCAOB-0067",
        "standard": "AS 2201 - An Audit of Internal Control Over Financial Reporting That Is Integrated with An Audit of Financial Statements",
        "description": "Factors affecting the magnitude of potential misstatements due to control deficiencies.",
        "enforcement_guidelines": [
            "Consider the financial statement amounts exposed to the deficiency.",
            "Assess the volume of activity in the account balance or class of transactions."
        ]
    },
    {
        "rule_id": "PCAOB-0068",
        "standard": "AS 2201 - An Audit of Internal Control Over Financial Reporting That Is Integrated with An Audit of Financial Statements",
        "description": "Role of compensating controls in mitigating control deficiencies.",
        "enforcement_guidelines": [
            "Evaluate if compensating controls prevent or detect misstatements."
        ]
    },
    {
        "rule_id": "PCAOB-0069",
        "standard": "AS 2201 - An Audit of Internal Control Over Financial Reporting That Is Integrated with An Audit of Financial Statements",
        "description": "Indicators of material weaknesses in internal control over financial reporting.",
        "enforcement_guidelines": [
            "Identify fraud by senior management.",
            "Check for restatements of financial statements.",
            "Assess if misstatements were not detected by internal controls.",
            "Evaluate audit committee oversight effectiveness."
        ]
    },
    {
        "rule_id": "PCAOB-0070",
        "standard": "AS 2201 - An Audit of Internal Control Over Financial Reporting That Is Integrated with An Audit of Financial Statements",
        "description": "Determining the severity of control deficiencies and their impact on prudent officials' assurance.",
        "enforcement_guidelines": [
            "Assess if deficiencies prevent reasonable assurance about transaction recording."
        ]
    },
    {
        "rule_id": "PCAOB-2201-85E",
        "standard": "AS 2201 - An Audit of Internal Control Over Financial Reporting That Is Integrated with An Audit of Financial Statements",
        "description": "Requirements for the structure and content of the auditor's report on internal control over financial reporting.",
        "enforcement_guidelines": [
            "Include the section title 'Definition and Limitations of Internal Control Over Financial Reporting'.",
            "State the definition of internal control over financial reporting as provided in paragraph .A5.",
            "Include a paragraph on the inherent limitations of internal control over financial reporting."
        ]
    },
    {
        "rule_id": "PCAOB-2201-85F",
        "standard": "AS 2201 - An Audit of Internal Control Over Financial Reporting That Is Integrated with An Audit of Financial Statements",
        "description": "Requirements for the signature, location, and date in the auditor's report.",
        "enforcement_guidelines": [
            "Include the signature of the auditor's firm.",
            "State the city and state (or city and country for non-U.S. auditors) from which the report is issued.",
            "Date the report no earlier than the date sufficient appropriate evidence was obtained to support the auditor's opinion."
        ]
    },
    {
        "rule_id": "PCAOB-2201-88",
        "standard": "AS 2201 - An Audit of Internal Control Over Financial Reporting That Is Integrated with An Audit of Financial Statements",
        "description": "Guidance for auditors when issuing separate reports on internal control over financial reporting.",
        "enforcement_guidelines": [
            "Add a paragraph to the financial statements report referencing the separate internal control audit.",
            "Add a paragraph to the internal control report referencing the financial statements audit.",
            "Ensure the reports are dated the same."
        ]
    },
    {
        "rule_id": "PCAOB-2201-90",
        "standard": "AS 2201 - An Audit of Internal Control Over Financial Reporting That Is Integrated with An Audit of Financial Statements",
        "description": "Requirements for auditors when material weaknesses are identified in internal control over financial reporting.",
        "enforcement_guidelines": [
            "Express an adverse opinion on internal control over financial reporting if a material weakness exists, unless there is a restriction on the scope of the engagement.",
            "Include the definition of a material weakness as stated in paragraph .A7.",
            "State that a material weakness has been identified and describe it."
        ]
    },
    {
        "rule_id": "PCAOB-2201-93",
        "standard": "AS 2201 - An Audit of Internal Control Over Financial Reporting That Is Integrated with An Audit of Financial Statements",
        "description": "Guidance for auditors regarding subsequent events affecting internal control over financial reporting.",
        "enforcement_guidelines": [
            "Inquire of management about changes in internal control or other factors that might significantly affect internal control over financial reporting subsequent to the date of the assessment.",
            "Obtain written representations from management relating to such matters.",
            "Examine relevant internal audit reports, independent auditor reports, regulatory agency reports, and other information about the effectiveness of internal control over financial reporting."
        ]
    },
    {
        "rule_id": "PCAOB-2201B1",
        "standard": "AS 2201 - An Audit of Internal Control Over Financial Reporting That Is Integrated with An Audit of Financial Statements",
        "description": "The objective of tests of controls in an audit of internal control over financial reporting is to obtain evidence about the effectiveness of controls to support the auditor's opinion on the company's internal control over financial reporting.",
        "enforcement_guidelines": [
            "Assess the effectiveness of controls in preventing or detecting material misstatements.",
            "Evaluate the sufficiency of evidence obtained from tests of controls.",
            "Document the results of tests of controls and their impact on the auditor's opinion."
        ]
    },
    {
        "rule_id": "PCAOB-2201B2",
        "standard": "AS 2201 - An Audit of Internal Control Over Financial Reporting That Is Integrated with An Audit of Financial Statements",
        "description": "To express an opinion on internal control over financial reporting, the auditor must obtain evidence that internal control over financial reporting has operated effectively for a sufficient period of time.",
        "enforcement_guidelines": [
            "Determine the period of time for which evidence of effective control operation is required.",
            "Obtain evidence through testing of controls over the identified period.",
            "Evaluate whether the evidence supports the conclusion on the effectiveness of internal control."
        ]
    },
    {
        "rule_id": "PCAOB-2201-B17",
        "standard": "AS 2201 - An Audit of Internal Control Over Financial Reporting That Is Integrated with An Audit of Financial Statements",
        "description": "The auditor must consider the controls at a service organization when auditing internal control over financial reporting, especially when the service organization's controls are part of the company's information system.",
        "enforcement_guidelines": [
            "Obtain an understanding of the controls at the service organization that are relevant to the company's internal control.",
            "Obtain evidence that the controls tested are operating effectively.",
            "Evaluate the service auditor's reputation, competence, and independence.",
            "Perform additional procedures if there are changes in the service organization's controls or if the time period between tests is significant."
        ]
    },
    {
        "rule_id": "PCAOB-2201-B28",
        "standard": "AS 2201 - An Audit of Internal Control Over Financial Reporting That Is Integrated with An Audit of Financial Statements",
        "description": "Automated application controls may be benchmarked if certain conditions are met, such as stable application controls and effective IT controls.",
        "enforcement_guidelines": [
            "Assess the risk factors for benchmarking, including the stability of the application, the effectiveness of IT controls, and the nature of changes to the application.",
            "Verify that the automated application controls have not changed since the last test by obtaining evidence such as reports of compilation dates of programs placed in production.",
            "Re-establish the baseline for automated application controls periodically based on the assessed risk factors.",
            "Evaluate the consequences of errors associated with the benchmarked control and whether the control is sensitive to changes in business factors."
        ]
    },
    {
        "rule_id": "PCAOB-2201-C4",
        "standard": "AS 2201 - An Audit of Internal Control Over Financial Reporting That Is Integrated with An Audit of Financial Statements",
        "description": "When disclaiming an opinion due to a scope limitation, the auditor must state that the audit scope was insufficient and provide the substantive reasons for the disclaimer without identifying specific procedures or certain statements.",
        "enforcement_guidelines": [
            "State that the scope of the audit was not sufficient to warrant the expression of an opinion.",
            "Provide the substantive reasons for the disclaimer in a separate paragraph or paragraphs.",
            "Do not identify the procedures that were performed or include statements describing the characteristics of an audit of internal control over financial reporting."
        ]
    },
    {
        "rule_id": "PCAOB-2201-C5",
        "standard": "AS 2201 - An Audit of Internal Control Over Financial Reporting That Is Integrated with An Audit of Financial Statements",
        "description": "If the auditor concludes that a material weakness exists in internal control over financial reporting due to a scope limitation, the auditor must describe the material weakness in the audit report.",
        "enforcement_guidelines": [
            "Define a material weakness as provided in paragraph .A7.",
            "Describe any material weaknesses identified in the company's internal control over financial reporting.",
            "Address the requirements in paragraph .91 regarding the description of material weaknesses."
        ]
    },
    {
        "rule_id": "PCAOB-2201-C6",
        "standard": "AS 2201 - An Audit of Internal Control Over Financial Reporting That Is Integrated with An Audit of Financial Statements",
        "description": "The lead auditor must participate sufficiently in the audit of internal control over financial reporting to serve as the lead auditor of internal control over financial reporting.",
        "enforcement_guidelines": [
            "Ensure the lead auditor of the consolidated financial statements participates sufficiently in the audit of internal control over financial reporting.",
            "Ensure the lead auditor can serve as the lead auditor of internal control over financial reporting."
        ]
    },
    {
        "rule_id": "PCAOB-2201-C12",
        "standard": "AS 2201 - An Audit of Internal Control Over Financial Reporting That Is Integrated with An Audit of Financial Statements",
        "description": "If management's annual report on internal control over financial reporting includes additional information that could reasonably be viewed as part of the report, the auditor must disclaim an opinion on that information if it contains a material misstatement of fact.",
        "enforcement_guidelines": [
            "Assess whether management's annual report includes additional information that could reasonably be viewed as part of the report.",
            "Disclaim an opinion on the information if it contains a material misstatement of fact.",
            "Follow the communication responsibilities as described in AS 4105 if the information contains a material misstatement of fact."
        ]
    },
    {
        "rule_id": "PCAOB-2301",
        "standard": "AS 2301 - The Auditor's Responses to the Risks of Material Misstatement",
        "description": "This standard outlines the auditor's responsibilities in designing and implementing audit responses to address the risks of material misstatement. It emphasizes the importance of professional skepticism and the need to incorporate elements of unpredictability in audit procedures to effectively address fraud risks.",
        "enforcement_guidelines": [
            "Make appropriate assignments of significant engagement responsibilities, ensuring that the knowledge, skill, and ability of engagement team members are commensurate with the assessed risks of material misstatement.",
            "Provide the extent of supervision that is appropriate for the circumstances, particularly in light of the assessed risks of material misstatement.",
            "Incorporate an element of unpredictability in the selection of auditing procedures to be performed from year to year, such as varying the timing of audit procedures or selecting items for testing that have lower amounts or are otherwise outside customary selection parameters.",
            "Evaluate the company's selection and application of significant accounting principles, particularly those related to subjective measurements and complex transactions, to identify potential biases that could lead to material misstatement."
        ]
    },
    {
        "rule_id": "PCAOB-2301-17",
        "standard": "AS 2301 - The Auditor's Responses to the Risks of Material Misstatement",
        "description": "Auditors must perform tests of controls when substantive procedures alone cannot provide sufficient appropriate audit evidence for relevant assertions.",
        "enforcement_guidelines": [
            "Identify relevant assertions where tests of controls are necessary.",
            "Design and perform tests of controls to assess their effectiveness.",
            "Evaluate the sufficiency and appropriateness of audit evidence obtained from tests of controls."
        ]
    },
    {
        "rule_id": "PCAOB-2301-19",
        "standard": "AS 2301 - The Auditor's Responses to the Risks of Material Misstatement",
        "description": "Auditors must test the design effectiveness of controls to determine if they are designed to meet control objectives.",
        "enforcement_guidelines": [
            "Perform procedures to test design effectiveness of controls.",
            "Use a mix of inquiry, observation, and inspection of relevant documentation.",
            "Evaluate alternative controls in smaller, less complex entities."
        ]
    },
    {
        "rule_id": "PCAOB-2301-21",
        "standard": "AS 2301 - The Auditor's Responses to the Risks of Material Misstatement",
        "description": "Auditors must test the operating effectiveness of controls to determine if they are operating as designed.",
        "enforcement_guidelines": [
            "Perform tests of operating effectiveness using appropriate procedures.",
            "Use a mix of inquiry, observation, inspection, and re-performance of controls.",
            "Give particular attention to automated controls."
        ]
    },
    {
        "rule_id": "PCAOB-2301-24",
        "standard": "AS 2301 - The Auditor's Responses to the Risks of Material Misstatement",
        "description": "Auditors must perform tests of controls that provide sufficient evidence about the effectiveness of controls.",
        "enforcement_guidelines": [
            "Use a mix of tests, including inquiry, observation, inspection, and re-performance.",
            "Do not rely solely on inquiry for testing control effectiveness.",
            "Consider the nature of the control when selecting appropriate tests."
        ]
    },
    {
        "rule_id": "PCAOB-2301-27",
        "standard": "AS 2301 - The Auditor's Responses to the Risks of Material Misstatement",
        "description": "Auditors must consider factors that affect the extent of testing of controls.",
        "enforcement_guidelines": [
            "Consider the frequency of control performance.",
            "Evaluate the length of the period of reliance.",
            "Assess the expected rate of deviation from controls.",
            "Evaluate the relevance and reliability of audit evidence."
        ]
    },
    {
        "rule_id": "PCAOB-2301-32",
        "standard": "AS 2301 - The Auditor's Responses to the Risks of Material Misstatement",
        "description": "Auditors must assess control risk based on evidence obtained from all sources.",
        "enforcement_guidelines": [
            "Evaluate evidence from tests of controls, misstatements detected, and control deficiencies.",
            "Assess control risk at the maximum level when controls are ineffective or evidence is insufficient.",
            "Document the basis for control risk assessments."
        ]
    },
    {
        "rule_id": "PCAOB-2301-34",
        "standard": "AS 2301 - The Auditor's Responses to the Risks of Material Misstatement",
        "description": "Auditors must evaluate the severity of control deficiencies and their impact on control risk assessments.",
        "enforcement_guidelines": [
            "Evaluate the severity of identified control deficiencies.",
            "Assess the impact of deficiencies on control risk.",
            "Revise control risk assessments and modify substantive procedures as necessary."
        ]
    },
    {
        "rule_id": "PCAOB-2301",
        "standard": "AS 2301 - The Auditor's Responses to the Risks of Material Misstatement",
        "description": "Auditors must perform substantive procedures for each relevant assertion of significant accounts and disclosures to detect material misstatements.",
        "enforcement_guidelines": [
            "Reconcile financial statements with underlying accounting records.",
            "Examine material adjustments made during the preparation of financial statements.",
            "Assess the risk of material misstatement and adjust the nature, timing, and extent of substantive procedures accordingly.",
            "Evaluate the evidence obtained from substantive procedures to support conclusions about the financial statements."
        ]
    },
    {
        "rule_id": "PCAOB-2305",
        "standard": "AS 2305 - Substantive Analytical Procedures",
        "description": "This standard establishes requirements for the use of substantive analytical procedures in an audit, including the development of expectations, evaluation of significant differences, and documentation of procedures.",
        "enforcement_guidelines": [
            "Develop expectations by identifying and using plausible relationships that are reasonably expected to exist based on the auditor's understanding of the client and industry.",
            "Evaluate the plausibility and predictability of relationships to determine the effectiveness of analytical procedures.",
            "Assess the availability and reliability of data used to develop expectations.",
            "Consider the precision of expectations to ensure that significant differences from expectations are identified and investigated.",
            "Investigate significant unexpected differences by reconsidering the methods and factors used in developing expectations and corroborating findings with other evidence.",
            "Document all significant aspects of the analytical procedures, including the expectation, comparison results, and additional procedures performed."
        ]
    },
    {
        "rule_id": "PCAOB-2310",
        "standard": "AS 2310 - The Auditor’s Use of Confirmation",
        "description": "This standard establishes requirements for auditors to obtain relevant and reliable audit evidence through the use of confirmation. It covers designing confirmation requests, maintaining control over the confirmation process, evaluating confirmation responses, and performing alternative procedures when necessary.",
        "enforcement_guidelines": [
            "Identify the information to be confirmed and select confirming parties who are knowledgeable about the information.",
            "Directly send confirmation requests to confirming parties and receive responses directly from them.",
            "Engage intermediaries only when necessary and evaluate the implications on the reliability of confirmation requests and responses.",
            "Evaluate the reliability of confirmation responses and perform alternative procedures if the response is unreliable or if there is a nonresponse.",
            "Perform alternative procedures for selected items when unable to obtain reliable confirmation responses."
        ]
    },
    {
        "rule_id": "PCAOB-2310-20",
        "standard": "AS 2310 - The Auditor’s Use of Confirmation",
        "description": "Auditors must evaluate confirmation exceptions to determine if they indicate a misstatement or a deficiency in internal control over financial reporting.",
        "enforcement_guidelines": [
            "Evaluate confirmation exceptions to identify potential misstatements or control deficiencies.",
            "Determine if exceptions individually or in aggregate indicate a misstatement or control deficiency.",
            "Communicate findings to management and the audit committee as necessary."
        ]
    },
    {
        "rule_id": "PCAOB-2310-21",
        "standard": "AS 2310 - The Auditor’s Use of Confirmation",
        "description": "Auditors must follow up on nonresponses to positive confirmation requests and evaluate any subsequent responses.",
        "enforcement_guidelines": [
            "Follow up on nonresponses to positive confirmation requests.",
            "Evaluate any subsequent confirmation responses received.",
            "Perform alternative procedures if unable to obtain a response."
        ]
    },
    {
        "rule_id": "PCAOB-2310-22",
        "standard": "AS 2310 - The Auditor’s Use of Confirmation",
        "description": "Auditors must ensure confirmation responses are sent directly to them and treat nonreceipt as a nonresponse.",
        "enforcement_guidelines": [
            "Contact the confirming party to request a direct response.",
            "Treat the situation as a nonresponse if a direct response is not received.",
            "Perform alternative procedures if unable to obtain a direct response."
        ]
    },
    {
        "rule_id": "PCAOB-2310-23",
        "standard": "AS 2310 - The Auditor’s Use of Confirmation",
        "description": "Auditors must perform alternative procedures for nonresponses or incomplete responses to confirmation requests.",
        "enforcement_guidelines": [
            "Perform alternative procedures for nonresponding or incomplete confirmation requests.",
            "Evaluate the implications for the auditor’s assessment of risks of material misstatement.",
            "Document the results of alternative procedures and their impact on the audit."
        ]
    },
    {
        "rule_id": "PCAOB-2310",
        "standard": "AS 2310 - The Auditor’s Use of Confirmation",
        "description": "Guidelines for auditors on the use of confirmations to obtain audit evidence about account balances or classes of transactions.",
        "enforcement_guidelines": [
            "Evaluate the reliability of confirmation responses and the sufficiency of audit evidence obtained.",
            "Assess discrepancies between the confirmation responses and the entity's records and investigate any significant discrepancies.",
            "Perform alternative procedures when confirmations are not feasible or reliable."
        ]
    },
    {
        "rule_id": "PCAOB-2315",
        "standard": "AS 2315 - Audit Sampling",
        "description": "Standards for planning, performing, and evaluating audit samples in both tests of controls and substantive tests of details.",
        "enforcement_guidelines": [
            "Design audit samples to achieve specific audit objectives and consider the nature of the population being sampled.",
            "Evaluate the results of the sample to draw conclusions about the population and consider the implications for the audit opinion.",
            "Document the rationale for the sampling approach, the evaluation of the sample results, and the conclusions reached."
        ]
    },
    {
        "rule_id": "PCAOB-2315-1",
        "standard": "AS 2315 - Audit Sampling",
        "description": "Planning a sample for a substantive test of details involves considering tolerable misstatement, allowable risk of incorrect acceptance, and population characteristics.",
        "enforcement_guidelines": [
            "Determine the tolerable misstatement for the account balance or class of transactions.",
            "Assess the allowable risk of incorrect acceptance based on the assessed levels of inherent and control risk.",
            "Consider the characteristics of the population, including the expected size and frequency of misstatements.",
            "Ensure that the sample size is appropriate to achieve the desired level of assurance."
        ]
    },
    {
        "rule_id": "PCAOB-2315-2",
        "standard": "AS 2315 - Audit Sampling",
        "description": "Evaluating the results of a sample for a substantive test of details involves projecting misstatements and considering qualitative aspects of misstatements.",
        "enforcement_guidelines": [
            "Project the misstatement results of the sample to the population.",
            "Compare the total projected misstatement with the tolerable misstatement for the account balance or class of transactions.",
            "Consider the qualitative aspects of misstatements, such as their nature, cause, and relationship to other aspects of the audit.",
            "Adjust the risk assessment and other audit tests as necessary based on the evaluation of the sample results."
        ]
    },
    {
        "rule_id": "PCAOB-2315-3",
        "standard": "AS 2315 - Audit Sampling",
        "description": "Planning a sample for a test of controls involves considering the tolerable rate of deviations, allowable risk of assessing control risk too low, and population characteristics.",
        "enforcement_guidelines": [
            "Determine the tolerable rate of deviations from prescribed controls that would support the planned assessed level of control risk.",
            "Assess the allowable risk of assessing control risk too low based on the assessed levels of inherent and control risk.",
            "Consider the characteristics of the population, including the nature of the controls and the likelihood of deviations.",
            "Ensure that the sample size is appropriate to achieve the desired level of assurance."
        ]
    },
    {
        "rule_id": "PCAOB-2315-39",
        "standard": "AS 2315 - Audit Sampling",
        "description": "Sample items should be selected to ensure the sample is representative of the population, with all items having an opportunity to be selected.",
        "enforcement_guidelines": [
            "Ensure that all items in the population have an equal chance of being selected.",
            "Use random-based selection methods to achieve representativeness."
        ]
    },
    {
        "rule_id": "PCAOB-2315-40",
        "standard": "AS 2315 - Audit Sampling",
        "description": "Auditors must apply appropriate audit procedures to each sample item and evaluate deviations from prescribed policies or procedures.",
        "enforcement_guidelines": [
            "Apply planned audit procedures or appropriate alternatives to each sample item.",
            "Evaluate reasons for deviations and their implications for the audit."
        ]
    },
    {
        "rule_id": "PCAOB-2315-41",
        "standard": "AS 2315 - Audit Sampling",
        "description": "Auditors must evaluate both the frequency and qualitative aspects of deviations from controls.",
        "enforcement_guidelines": [
            "Assess the nature and cause of deviations (e.g., errors, irregularities, misunderstandings, carelessness).",
            "Consider the relationship of deviations to other audit areas."
        ]
    },
    {
        "rule_id": "PCAOB-2315-43",
        "standard": "AS 2315 - Audit Sampling",
        "description": "Dual-purpose samples can be used for both tests of controls and substantive tests, provided the sample size is adequate for both purposes.",
        "enforcement_guidelines": [
            "Design the sample size as the larger of what would be needed for separate purposes.",
            "Evaluate deviations and monetary misstatements separately for each purpose."
        ]
    },
    {
        "rule_id": "PCAOB-2401",
        "standard": "AS 2401 - Consideration of Fraud in a Financial Statement Audit",
        "description": "Auditors must consider the risk of material misstatement due to fraud in financial statements. This involves identifying and assessing fraud risks, designing and implementing appropriate audit procedures, and communicating findings to relevant parties.",
        "enforcement_guidelines": [
            "Identify and assess the risks of material misstatement due to fraud in the financial statements.",
            "Exercise professional skepticism throughout the audit process, especially when considering the possibility of fraud.",
            "Design and implement audit procedures to address the assessed risks of material misstatement due to fraud.",
            "Communicate findings about fraud risks and related audit procedures to management, the audit committee, and regulatory authorities as appropriate."
        ]
    },
    {
        "rule_id": "PCAOB-2401",
        "standard": "AS 2401 - Consideration of Fraud in a Financial Statement Audit",
        "description": "Auditors must consider the risk of material misstatement due to fraud and exercise professional skepticism. This involves identifying and assessing fraud risks, designing and performing audit procedures to address these risks, and responding appropriately to detected fraud.",
        "enforcement_guidelines": [
            "Perform surprise inventory counts and observe inventory counts at unexpected locations or dates.",
            "Confirm with customers certain contract terms and the absence of side agreements.",
            "Use computer-assisted audit techniques to identify unusual revenue relationships or transactions.",
            "Test controls related to the prevention and detection of asset misappropriation and management override of controls.",
            "Perform substantive analytical procedures using disaggregated data to identify unusual trends or relationships.",
            "Conduct interviews with sales and marketing personnel regarding sales and shipments near the end of the reporting period.",
            "Review and test the reasonableness of management estimates and underlying assumptions."
        ]
    },
    {
        "rule_id": "PCAOB-2401-01",
        "standard": "AS 2401 - Consideration of Fraud in a Financial Statement Audit",
        "description": "Auditors must examine journal entries and other adjustments to detect potential fraud, focusing on entries made at the end of the reporting period.",
        "enforcement_guidelines": [
            "Obtain an understanding of the entity's financial reporting process and controls over journal entries and other adjustments.",
            "Identify and select journal entries and other adjustments for testing, particularly those made at the end of the period.",
            "Evaluate the business purpose of significant unusual transactions to determine if they may have been entered into to engage in fraudulent financial reporting or conceal misappropriation of assets."
        ]
    },
    {
        "rule_id": "PCAOB-2401-02",
        "standard": "AS 2401 - Consideration of Fraud in a Financial Statement Audit",
        "description": "Auditors must review accounting estimates for potential biases that could result in material misstatements due to fraud.",
        "enforcement_guidelines": [
            "Perform a retrospective review of accounting estimates in significant accounts and disclosures by comparing prior year estimates to actual results.",
            "Evaluate whether circumstances producing such a bias represent a risk of a material misstatement due to fraud.",
            "Consider whether adjustments to current-year estimates might be recorded at the instruction of management to arbitrarily achieve a specified earnings target."
        ]
    },
    {
        "rule_id": "PCAOB-2401-03",
        "standard": "AS 2401 - Consideration of Fraud in a Financial Statement Audit",
        "description": "Auditors must evaluate significant unusual transactions to determine if they may have been entered into to engage in fraudulent financial reporting or conceal misappropriation of assets.",
        "enforcement_guidelines": [
            "Design and perform procedures to obtain an understanding of the business purpose (or the lack thereof) of each significant unusual transaction.",
            "Evaluate whether the form of the transaction is overly complex or lacks commercial or economic substance.",
            "Determine whether the transaction enables the company to achieve certain financial targets or if management places undue emphasis on achieving specific earnings targets."
        ]
    },
    {
        "rule_id": "PCAOB-2401",
        "standard": "AS 2401 - Consideration of Fraud in a Financial Statement Audit",
        "description": "Guidelines for auditors to identify, assess, and respond to risks of material misstatement due to fraud in financial statements.",
        "enforcement_guidelines": [
            "Identify and assess fraud risks, including incentives/pressures, opportunities, and attitudes/rationalizations that could lead to material misstatements.",
            "Document discussions among engagement personnel regarding the susceptibility of the entity's financial statements to material misstatement due to fraud.",
            "Perform procedures to obtain information necessary to identify and assess fraud risks, including those related to fraudulent financial reporting and misappropriation of assets.",
            "Communicate fraud risks and findings to management, the audit committee, and regulatory authorities when necessary.",
            "Document the results of procedures performed to address assessed fraud risks, including those related to management override of controls.",
            "Evaluate whether the absence of or deficiencies in controls addressing fraud risks represent significant deficiencies or material weaknesses."
        ]
    },
    {
        "rule_id": "PCAOB-2401",
        "standard": "AS 2401 - Consideration of Fraud in a Financial Statement Audit",
        "description": "Auditors must identify and assess risks of material misstatement due to fraud, including both fraudulent financial reporting and misappropriation of assets. They must exercise professional skepticism throughout the audit and consider relevant risk factors.",
        "enforcement_guidelines": [
            "Identify and assess risks of material misstatement due to fraud.",
            "Exercise professional skepticism throughout the audit process.",
            "Consider risk factors related to fraudulent financial reporting, such as management override of controls, incentives, and opportunities.",
            "Consider risk factors related to misappropriation of assets, including incentives/pressures, opportunities, and attitudes/rationalizations.",
            "Perform audit procedures to address identified risks of material misstatement due to fraud.",
            "Communicate findings related to fraud risks and findings to management, the audit committee, and regulatory authorities when necessary."
        ]
    },
    {
        "rule_id": "PCAOB-2401",
        "standard": "AS 2401 - Consideration of Fraud in a Financial Statement Audit",
        "description": "Auditors must exercise professional skepticism to detect and respond to fraud risks in financial statements.",
        "enforcement_guidelines": [
            "Identify and assess fraud risks, including the risk of management override of controls.",
            "Implement audit procedures to address fraud risks and verify financial accuracy.",
            "Communicate fraud risks and findings to management, the audit committee, and regulatory authorities when necessary."
        ]
    },
    {
        "rule_id": "PCAOB-2405",
        "standard": "AS 2405 - Illegal Acts by Clients",
        "description": "Guidelines for auditors to consider the possibility of illegal acts by clients and their impact on financial statements.",
        "enforcement_guidelines": [
            "Inquire of management and the audit committee concerning the client's compliance with laws and regulations.",
            "Obtain written representations from management concerning the absence of violations or possible violations of laws or regulations.",
            "If specific information concerning possible illegal acts is encountered, obtain an understanding of the nature of the act and its effect on the financial statements.",
            "Consult with the client's legal counsel or other specialists about the application of relevant laws and regulations to the circumstances and the possible effects on the financial statements."
        ]
    },
    {
        "rule_id": "PCAOB-2405-12",
        "standard": "AS 2405 - Illegal Acts by Clients",
        "description": "Auditors must consider the effect of illegal acts on financial statements and communicate with the audit committee.",
        "enforcement_guidelines": [
            "Evaluate the materiality of the illegal act, considering both quantitative and qualitative factors.",
            "Assess the effect of the illegal act on the financial statements, including contingent monetary effects.",
            "Communicate the illegal act, its circumstances, and financial statement effects to the audit committee as soon as practicable."
        ]
    },
    {
        "rule_id": "PCAOB-2405-18",
        "standard": "AS 2405 - Illegal Acts by Clients",
        "description": "Auditors must qualify or modify their opinion if an illegal act has a material effect on financial statements that is not properly accounted for or disclosed.",
        "enforcement_guidelines": [
            "Determine if the illegal act has a material effect on the financial statements.",
            "Evaluate whether the illegal act has been properly accounted for or disclosed.",
            "Modify the audit opinion to a qualified or adverse opinion if the illegal act's effect is material and not properly addressed."
        ]
    },
    {
        "rule_id": "PCAOB-2405-19",
        "standard": "AS 2405 - Illegal Acts by Clients",
        "description": "Auditors must disclaim an opinion if they are precluded from obtaining sufficient appropriate evidence regarding a material illegal act.",
        "enforcement_guidelines": [
            "Assess whether sufficient appropriate evidence regarding the illegal act can be obtained.",
            "Evaluate the materiality of the illegal act's effect on the financial statements.",
            "Disclaim an opinion if unable to obtain sufficient evidence regarding a material illegal act."
        ]
    },
    {
        "rule_id": "PCAOB-2405-20",
        "standard": "AS 2405 - Illegal Acts by Clients",
        "description": "Auditors must withdraw from the engagement if the client refuses to accept a modified audit report due to an illegal act.",
        "enforcement_guidelines": [
            "Document the reasons for withdrawal in writing.",
            "Communicate the withdrawal to the audit committee or board of directors in writing.",
            "Ensure the withdrawal letter includes the reasons for withdrawal and any related circumstances."
        ]
    },
    {
        "rule_id": "PCAOB-2410",
        "standard": "AS 2410 - Related Parties",
        "description": "Ensures that auditors properly identify, account for, and disclose relationships and transactions with related parties in financial statements.",
        "enforcement_guidelines": [
            "Perform risk assessment procedures to understand the company's relationships and transactions with related parties.",
            "Identify and assess risks of material misstatement associated with related parties and their transactions.",
            "Design and implement audit responses to address identified risks, including evaluating the business purpose of transactions.",
            "Evaluate whether the company has properly identified, accounted for, and disclosed related parties and their transactions.",
            "Perform procedures on intercompany account balances as of concurrent dates.",
            "Communicate findings and implications to the engagement team and referred auditors."
        ]
    },
    {
        "rule_id": "PCAOB-2410-17",
        "standard": "AS 2410 - Related Parties",
        "description": "Auditors must evaluate whether related party transactions have been properly accounted for and disclosed in the financial statements.",
        "enforcement_guidelines": [
            "Assess whether related party transactions are accurately recorded and disclosed in accordance with applicable financial reporting standards.",
            "Review the financial statements for completeness and accuracy of related party disclosures.",
            "Discuss with management the nature and terms of related party transactions to ensure proper accounting."
        ]
    },
    {
        "rule_id": "PCAOB-2410-18",
        "standard": "AS 2410 - Related Parties",
        "description": "Auditors must evaluate management's assertion that related party transactions were conducted on terms equivalent to arm's-length transactions.",
        "enforcement_guidelines": [
            "Obtain sufficient audit evidence to support or contradict management's assertion regarding arm's-length terms.",
            "Communicate findings to management and request modifications to disclosures if necessary.",
            "Consider the impact on the audit opinion if evidence is insufficient to support management's assertion."
        ]
    },
    {
        "rule_id": "PCAOB-2410-19",
        "standard": "AS 2410 - Related Parties",
        "description": "Auditors must communicate significant matters related to related party relationships and transactions to the audit committee.",
        "enforcement_guidelines": [
            "Communicate to the audit committee the auditor's evaluation of the company's identification, accounting, and disclosure of related party relationships and transactions.",
            "Discuss with the audit committee any significant related party transactions that were not authorized or approved in accordance with company policies.",
            "Explain the implications of management's assertions regarding arm's-length transactions and the evidence obtained to support or contradict such assertions."
        ]
    },
    {
        "rule_id": "PCAOB-2415-02",
        "standard": "AS 2415 - Consideration of an Entity's Ability to Continue as a Going Concern",
        "description": "The auditor must evaluate whether there is substantial doubt about the entity's ability to continue as a going concern for a reasonable period of time, based on conditions and events identified during the audit.",
        "enforcement_guidelines": [
            "Evaluate conditions and events that indicate substantial doubt about the entity's ability to continue as a going concern.",
            "Assess the likelihood of management's plans to mitigate adverse effects being effectively implemented.",
            "Conclude whether there is substantial doubt about the entity's ability to continue as a going concern and communicate findings appropriately."
        ]
    },
    {
        "rule_id": "PCAOB-2415-05",
        "standard": "AS 2415 - Consideration of an Entity's Ability to Continue as a Going Concern",
        "description": "The auditor should perform audit procedures to identify conditions and events that may indicate substantial doubt about the entity's ability to continue as a going concern.",
        "enforcement_guidelines": [
            "Perform analytical procedures to identify negative trends and other indicators of financial difficulties.",
            "Review subsequent events that may affect the entity's ability to continue as a going concern.",
            "Consider internal matters such as work stoppages or substantial dependence on a particular project.",
            "Evaluate external matters such as legal proceedings or loss of key customers."
        ]
    },
    {
        "rule_id": "PCAOB-2415-09",
        "standard": "AS 2415 - Consideration of an Entity's Ability to Continue as a Going Concern",
        "description": "Auditors must request and assess prospective financial information, focusing on significant assumptions, especially those that are material, sensitive, or inconsistent with historical trends.",
        "enforcement_guidelines": [
            "Request management to provide prospective financial information.",
            "Assess the adequacy of support for significant assumptions underlying the information.",
            "Give particular attention to assumptions that are material, sensitive, or inconsistent with historical trends.",
            "Compare prospective financial information with prior periods and actual results.",
            "Discuss factors not reflected in the prospective financial information with management."
        ]
    },
    {
        "rule_id": "PCAOB-2415-10",
        "standard": "AS 2415 - Consideration of an Entity's Ability to Continue as a Going Concern",
        "description": "When substantial doubt exists, auditors must evaluate the effects on financial statements and ensure adequate disclosure.",
        "enforcement_guidelines": [
            "Consider the possible effects of conditions and events on the financial statements.",
            "Assess the adequacy of related disclosures.",
            "Include information about conditions, events, management's evaluation, and possible discontinuance of operations."
        ]
    },
    {
        "rule_id": "PCAOB-2415-12",
        "standard": "AS 2415 - Consideration of an Entity's Ability to Continue as a Going Concern",
        "description": "If substantial doubt remains, the audit report must include an explanatory paragraph.",
        "enforcement_guidelines": [
            "Include an explanatory paragraph immediately following the opinion paragraph.",
            "Use the phrase 'substantial doubt about its ability to continue as a going concern'."
        ]
    },
    {
        "rule_id": "PCAOB-2415-17",
        "standard": "AS 2415 - Consideration of an Entity's Ability to Continue as a Going Concern",
        "description": "Auditors must document their evaluation of conditions, management's plans, and conclusions regarding substantial doubt.",
        "enforcement_guidelines": [
            "Document conditions or events leading to substantial doubt.",
            "Document significant elements of management's plans.",
            "Document auditing procedures and evidence obtained.",
            "Document conclusions on whether substantial doubt remains or is alleviated.",
            "Document conclusions on the need for disclosure."
        ]
    },
    {
        "rule_id": "PCAOB-2501",
        "standard": "AS 2501 - Auditing Accounting Estimates, Including Fair Value Measurements",
        "description": "Auditors must obtain sufficient appropriate evidence to determine whether accounting estimates in significant accounts and disclosures are properly accounted for and disclosed in the financial statements.",
        "enforcement_guidelines": [
            "Identify and assess risks of material misstatement related to accounting estimates.",
            "Test the company's process used to develop the accounting estimate.",
            "Develop an independent expectation for comparison to the company's estimate.",
            "Evaluate audit evidence from events or transactions occurring after the measurement date related to the accounting estimate.",
            "Use the work of a company's specialist if applicable.",
            "Evaluate third-party pricing information when auditing the fair values of financial instruments."
        ]
    },
    {
        "rule_id": "PCAOB-2501-01",
        "standard": "AS 2501 - Auditing Accounting Estimates, Including Fair Value Measurements",
        "description": "Auditors must independently derive assumptions or use their own methods when developing an independent expectation, ensuring a reasonable basis for these assumptions and methods.",
        "enforcement_guidelines": [
            "Ensure assumptions and methods used are reasonable and well-supported."
        ]
    },
    {
        "rule_id": "PCAOB-2501-02",
        "standard": "AS 2501 - Auditing Accounting Estimates, Including Fair Value Measurements",
        "description": "When using data or assumptions from a third party, the auditor must evaluate their relevance and reliability in accordance with AS 1105.",
        "enforcement_guidelines": [
            "Evaluate the relevance and reliability of third-party data and assumptions."
        ]
    },
    {
        "rule_id": "PCAOB-2501-03",
        "standard": "AS 2501 - Auditing Accounting Estimates, Including Fair Value Measurements",
        "description": "If the auditor uses company data, assumptions, or methods, they must test the data, evaluate the reasonableness of assumptions, and assess the methods used.",
        "enforcement_guidelines": [
            "Test company data in accordance with paragraphs .12–.14.",
            "Evaluate the reasonableness of significant assumptions in accordance with paragraphs .16–.18.",
            "Evaluate company methods in accordance with paragraphs .10–.11."
        ]
    },
    {
        "rule_id": "PCAOB-2501-04",
        "standard": "AS 2501 - Auditing Accounting Estimates, Including Fair Value Measurements",
        "description": "When developing an independent expectation as a range, the range must encompass only reasonable outcomes and be supported by sufficient appropriate evidence.",
        "enforcement_guidelines": [
            "Ensure the range encompasses only reasonable outcomes.",
            "Confirm that the range is supported by sufficient appropriate evidence."
        ]
    },
    {
        "rule_id": "PCAOB-2501-05",
        "standard": "AS 2501 - Auditing Accounting Estimates, Including Fair Value Measurements",
        "description": "The auditor must compare their independent expectation to the company's estimate and evaluate differences in accordance with AS 2810.13.",
        "enforcement_guidelines": [
            "Compare the auditor's independent expectation to the company's estimate.",
            "Evaluate differences in accordance with AS 2810.13."
        ]
    },
    {
        "rule_id": "PCAOB-2501-06",
        "standard": "AS 2501 - Auditing Accounting Estimates, Including Fair Value Measurements",
        "description": "Auditors must evaluate whether audit evidence from events or transactions occurring after the measurement date is sufficient, reliable, and relevant to the company's accounting estimate.",
        "enforcement_guidelines": [
            "Evaluate the sufficiency, reliability, and relevance of audit evidence from post-measurement date events or transactions.",
            "Assess whether the evidence supports or contradicts the company's estimate."
        ]
    },
    {
        "rule_id": "PCAOB-2501-07",
        "standard": "AS 2501 - Auditing Accounting Estimates, Including Fair Value Measurements",
        "description": "Auditors must evaluate audit results, including identified misstatements, potential bias in estimates, and the presentation of financial statements.",
        "enforcement_guidelines": [
            "Evaluate identified misstatements.",
            "Assess potential bias in accounting estimates.",
            "Evaluate the presentation of financial statements, including disclosures and essential information."
        ]
    },
    {
        "rule_id": "PCAOB-2505",
        "standard": "AS 2505 - Inquiry of a Client's Lawyer Concerning Litigation, Claims, and Assessments",
        "description": "Guidance on procedures for identifying litigation, claims, and assessments and ensuring proper financial reporting.",
        "enforcement_guidelines": [
            "Obtain evidential matter regarding the existence of conditions indicating uncertainty as to the outcome of litigation, claims, or assessments.",
            "Assess the likelihood of an unfavorable outcome of the litigation, claims, or assessments.",
            "Evaluate the ability to estimate the financial effect of the unfavorable outcome.",
            "Ensure adequate disclosure of the nature of the litigation, claims, or assessments and their potential financial impact."
        ]
    },
    {
        "rule_id": "PCAOB-2505",
        "standard": "AS 2505 - Inquiry of a Client's Lawyer Concerning Litigation, Claims, and Assessments",
        "description": "This standard outlines the procedures an auditor must follow to inquire with a client's lawyer about litigation, claims, and assessments to ensure proper financial reporting.",
        "enforcement_guidelines": [
            "Inquire of and discuss with management about their policies and procedures for identifying, evaluating, and accounting for litigation, claims, and assessments.",
            "Obtain from management a description and evaluation of pending or threatened litigation, claims, and assessments, including those referred to legal counsel.",
            "Examine documents in the client's possession concerning litigation, claims, and assessments, such as correspondence and invoices from lawyers.",
            "Obtain written assurance from management that they have disclosed all matters required by Statement of Financial Accounting Standards No. 5.",
            "Send an inquiry letter to the client's lawyer to corroborate the information provided by management regarding litigation, claims, and assessments.",
            "Consider the lawyer's response, including any limitations or refusals to provide information, which may affect the auditor's opinion."
        ]
    },
    {
        "rule_id": "PCAOB-2505",
        "standard": "AS 2505 - Inquiry of a Client's Lawyer Concerning Litigation, Claims, and Assessments",
        "description": "This standard outlines the proper procedure for auditors to inquire with a client's lawyer regarding litigation, claims, and assessments, ensuring that such inquiries are conducted in a manner that respects client confidentiality and professional standards.",
        "enforcement_guidelines": [
            "The lawyer may properly respond to the auditor's requests for information concerning loss contingencies if the client has consented to such disclosure and the lawyer has been engaged by the client to represent or advise the client professionally with respect to such matters.",
            "The lawyer's response should be limited to items which are considered individually or collectively material to the presentation of the client's financial statements.",
            "The lawyer should identify and describe overtly threatened or pending litigation, contractually assumed obligations, or unasserted possible claims or assessments that the client has specifically identified.",
            "The lawyer should provide information concerning the stage of the proceedings, the claim(s) asserted, and the position taken by the client.",
            "The lawyer should refrain from expressing judgments as to the outcome of the matter unless it is clear that an unfavorable outcome is either 'probable' or 'remote'.",
            "The lawyer should not be required to provide estimates of potential loss unless the probability of inaccuracy of the estimate is slight."
        ]
    },
    {
        "rule_id": "PCAOB-2505-01",
        "standard": "AS 2505 - Inquiry of a Client's Lawyer Concerning Litigation, Claims, and Assessments",
        "description": "The lawyer must advise the client on the need for public disclosure of loss contingencies and may be required to resign if the client disregards this advice.",
        "enforcement_guidelines": [
            "Advise the client on the necessity of public disclosure of loss contingencies.",
            "Resign from the engagement if the client disregards advice on disclosure requirements."
        ]
    },
    {
        "rule_id": "PCAOB-2505-02",
        "standard": "AS 2505 - Inquiry of a Client's Lawyer Concerning Litigation, Claims, and Assessments",
        "description": "The lawyer's response is limited to matters within their professional engagement and excludes information obtained in other capacities, such as being a director or officer.",
        "enforcement_guidelines": [
            "Limit response to matters handled in a professional capacity.",
            "Exclude information obtained as a director or officer unless it pertains to the legal engagement."
        ]
    },
    {
        "rule_id": "PCAOB-2505-03",
        "standard": "AS 2505 - Inquiry of a Client's Lawyer Concerning Litigation, Claims, and Assessments",
        "description": "The lawyer may limit their response to material items, provided they communicate this limitation to the auditor.",
        "enforcement_guidelines": [
            "Limit response to material items if agreed upon with the auditor.",
            "Clearly communicate any limitations on the scope of the response."
        ]
    },
    {
        "rule_id": "PCAOB-2505-04",
        "standard": "AS 2505 - Inquiry of a Client's Lawyer Concerning Litigation, Claims, and Assessments",
        "description": "The lawyer must respond to the auditor's inquiry regarding loss contingencies in accordance with FAS 5, providing information on the likelihood and estimation of losses.",
        "enforcement_guidelines": [
            "Respond to the auditor's inquiry regarding loss contingencies.",
            "Provide information on the likelihood and estimation of losses as per FAS 5."
        ]
    },
    {
        "rule_id": "PCAOB-2505",
        "standard": "AS 2505 - Inquiry of a Client's Lawyer Concerning Litigation, Claims, and Assessments",
        "description": "Auditors must assess the probability of unfavorable outcomes in litigation and ensure proper disclosure or accrual of loss contingencies in financial statements.",
        "enforcement_guidelines": [
            "Inquire of the client's lawyer regarding the probability of an unfavorable outcome in litigation, including whether the outcome is 'probable,' 'reasonably possible,' or 'remote.'",
            "Verify that the lawyer's assessment of the probability of an unfavorable outcome is based on sufficient evidence and professional judgment.",
            "Ensure that the client's financial statements disclose or accrue loss contingencies in accordance with FAS 5, including estimates of potential losses where appropriate."
        ]
    },
    {
        "rule_id": "PCAOB-2505",
        "standard": "AS 2505 - Inquiry of a Client's Lawyer Concerning Litigation, Claims, and Assessments",
        "description": "Auditors must inquire of the client's lawyer regarding litigation, claims, and assessments to identify and assess risks related to loss and gain contingencies.",
        "enforcement_guidelines": [
            "Request written responses from the client's lawyer regarding loss and gain contingencies.",
            "Review the lawyer's response to identify any material loss or gain contingencies.",
            "Evaluate the sufficiency of the lawyer's response and consider the need for additional procedures.",
            "Document the inquiry process and any findings in the audit workpapers."
        ]
    },
    {
        "rule_id": "PCAOB-2510-14",
        "standard": "AS 2510 - Auditing Inventories",
        "description": "Guidance for auditors when inventories are held in public warehouses, emphasizing the need to obtain reasonable assurance regarding the existence and condition of such inventories.",
        "enforcement_guidelines": [
            "Obtain direct written confirmation from the warehouse custodian regarding the existence and condition of the inventories.",
            "Test the owner's procedures for investigating the warehouseman and evaluating the warehouseman's performance.",
            "Observe physical counts of the goods if practicable and reasonable.",
            "If warehouse receipts have been pledged as collateral, confirm with lenders pertinent details of the pledged receipts on a test basis, if appropriate."
        ]
    },
    {
        "rule_id": "PCAOB-2601-03",
        "standard": "AS 2601 - Consideration of an Entity's Use of a Service Organization",
        "description": "Guidance for user auditors when the entity uses a service organization that is part of its information system, including considerations for evaluating the service organization's controls and obtaining reports from service auditors.",
        "enforcement_guidelines": [
            "Evaluate whether the service organization's controls are part of the user organization's information system and assess their relevance to the user organization's internal control.",
            "Obtain a report from the service auditor regarding the service organization's controls that may be relevant to the user organization's internal control.",
            "Test the operating effectiveness of the service organization's controls if the user auditor intends to use the service auditor's work as audit evidence.",
            "Consider the sufficiency and appropriateness of the evidence obtained from the service auditor's work."
        ]
    },
    {
        "rule_id": "PCAOB-2601-01",
        "standard": "AS 2601 - Consideration of an Entity's Use of a Service Organization",
        "description": "Auditors must consider the impact of a service organization on the user organization's internal controls and the availability of evidence to plan the audit, assess control risk, and perform substantive procedures.",
        "enforcement_guidelines": [
            "Obtain an understanding of the service organization's controls and their interaction with the user organization's controls.",
            "Assess the sufficiency of evidence provided by the service auditor's report and consider additional procedures if necessary.",
            "Evaluate the operating effectiveness of controls at the service organization if relevant to the user organization's financial statements."
        ]
    },
    {
        "rule_id": "PCAOB-2601-02",
        "standard": "AS 2601 - Consideration of an Entity's Use of a Service Organization",
        "description": "User auditors must evaluate the service auditor's report to determine its relevance to the user organization's financial statements and assess the effectiveness of controls at the service organization.",
        "enforcement_guidelines": [
            "Consider the professional reputation of the service auditor.",
            "Review the service auditor's report and assess its relevance to the user organization's financial statements.",
            "Supplement the service auditor's report with additional procedures if necessary to meet audit objectives."
        ]
    },
    {
        "rule_id": "PCAOB-2601",
        "standard": "AS 2601 - Consideration of an Entity's Use of a Service Organization",
        "description": "This standard outlines the requirements for service auditors when evaluating and reporting on the controls of a service organization that may be relevant to a user organization's internal control over financial reporting.",
        "enforcement_guidelines": [
            "Determine whether the service organization's description of controls provides sufficient information for user auditors to understand the controls that may be relevant to their internal control over financial reporting.",
            "Assess whether the controls were suitably designed to achieve the specified control objectives and whether they were placed in operation as of a specific date.",
            "Communicate any significant deficiencies in the design or operation of the service organization's controls to the appropriate parties, including the service organization's management and audit committee.",
            "Include in the report any significant changes to the service organization's controls that occurred before the beginning of the fieldwork and that would be considered significant by user organizations and their auditors.",
            "Consider whether to resign from the engagement if the service organization's management refuses to communicate significant deficiencies to user organizations and the audit committee does not respond appropriately."
        ]
    },
    {
        "rule_id": "PCAOB-2601-41",
        "standard": "AS 2601 - Consideration of an Entity's Use of a Service Organization",
        "description": "Requirements for a service auditor's report on controls placed in operation and tests of operating effectiveness.",
        "enforcement_guidelines": [
            "Include a specific reference to the applications, services, products, or other aspects of the service organization covered.",
            "Describe the scope and nature of the service auditor's procedures.",
            "Identify the party specifying the control objectives.",
            "State the purpose of the engagement and the opinion on the description of controls.",
            "Include a description of tests of operating effectiveness and their results.",
            "State the period covered by the report."
        ]
    },
    {
        "rule_id": "PCAOB-2601-44",
        "standard": "AS 2601 - Consideration of an Entity's Use of a Service Organization",
        "description": "Service auditor's responsibility to consider significant deficiencies in the service organization's controls.",
        "enforcement_guidelines": [
            "Identify conditions that represent significant deficiencies in the design or operation of controls.",
            "Assess whether such deficiencies could adversely affect the ability to achieve control objectives.",
            "Determine if user organizations would generally have controls to mitigate such deficiencies."
        ]
    },
    {
        "rule_id": "PCAOB-2601-49",
        "standard": "AS 2601 - Consideration of an Entity's Use of a Service Organization",
        "description": "Requirements for the service auditor to express an opinion on the design of controls.",
        "enforcement_guidelines": [
            "Ensure the service organization identifies and appropriately describes control objectives and relevant controls.",
            "Assess the linkage between controls and control objectives.",
            "Obtain sufficient evidence to support the opinion on the design of controls."
        ]
    },
    {
        "rule_id": "PCAOB-2601",
        "standard": "AS 2601 - Consideration of an Entity's Use of a Service Organization",
        "description": "Guidance for service auditors in evaluating and reporting on the controls of a service organization relevant to user organizations' financial statements.",
        "enforcement_guidelines": [
            "Assess the accuracy and completeness of the service organization's control descriptions.",
            "Report on the design and operating effectiveness of the service organization's controls.",
            "Identify and report any significant deficiencies in the service organization's controls.",
            "Consider subsequent events that may affect user organizations and disclose them if necessary.",
            "Obtain written representations from the service organization's management regarding controls and subsequent events."
        ]
    },
    {
        "rule_id": "PCAOB-2605",
        "standard": "AS 2605 - Consideration of the Internal Audit Function",
        "description": "Guidance for auditors on considering the work of internal auditors and using internal auditors to provide direct assistance in an audit.",
        "enforcement_guidelines": [
            "Consider the internal audit function's role in the entity's internal control over financial reporting.",
            "Assess the competence and objectivity of the internal auditors.",
            "Evaluate the effectiveness of the internal auditors' work and consider it in determining the nature, timing, and extent of the auditor's procedures.",
            "Coordinate audit work with internal auditors to avoid duplication of effort and to enhance the efficiency of the audit.",
            "Document the auditor's consideration of the internal audit function and the use of internal auditors' work in the audit documentation."
        ]
    },
    {
        "rule_id": "PCAOB-2605",
        "standard": "AS 2605 - Consideration of the Internal Audit Function",
        "description": "Auditors must consider the work of the internal audit function when planning and performing the audit of financial statements.",
        "enforcement_guidelines": [
            "Obtain an understanding of the internal audit function's activities relevant to the audit.",
            "Assess the competence and objectivity of the internal auditors.",
            "Consider the internal auditors' work when planning audit procedures.",
            "Ensure that the internal auditors' work does not diminish the auditor's responsibility for the audit opinion."
        ]
    },
    {
        "rule_id": "PCAOB-2605-01",
        "standard": "AS 2605 - Consideration of the Internal Audit Function",
        "description": "Auditors must evaluate the work of internal auditors and determine if it reduces audit risk to an acceptable level for certain financial statement assertions.",
        "enforcement_guidelines": [
            "Identify and assess the risk of material misstatement for each financial statement assertion.",
            "Evaluate the work performed by internal auditors related to significant financial statement assertions.",
            "Determine if the internal auditors' work reduces audit risk to an acceptable level for assertions with low risk of material misstatement or low subjectivity in audit evidence evaluation."
        ]
    },
    {
        "rule_id": "PCAOB-2605-02",
        "standard": "AS 2605 - Consideration of the Internal Audit Function",
        "description": "Auditors should coordinate their work with internal auditors to enhance audit efficiency and effectiveness.",
        "enforcement_guidelines": [
            "Hold periodic meetings with internal auditors to discuss audit plans and findings.",
            "Schedule audit work to align with internal audit activities where appropriate.",
            "Provide access to internal auditors' working papers for review and evaluation.",
            "Review internal audit reports to identify potential risks and areas requiring further investigation."
        ]
    },
    {
        "rule_id": "PCAOB-2605-03",
        "standard": "AS 2605 - Consideration of the Internal Audit Function",
        "description": "Auditors must evaluate the quality and effectiveness of internal auditors' work when it significantly affects the audit.",
        "enforcement_guidelines": [
            "Assess whether the internal auditors' scope of work is appropriate for meeting audit objectives.",
            "Evaluate the adequacy of internal auditors' audit programs and working papers.",
            "Review the appropriateness of internal auditors' conclusions in the context of the audit.",
            "Ensure that internal auditors' reports are consistent with the results of their work."
        ]
    },
    {
        "rule_id": "PCAOB-2605-04",
        "standard": "AS 2605 - Consideration of the Internal Audit Function",
        "description": "Auditors may request direct assistance from internal auditors, provided certain conditions are met.",
        "enforcement_guidelines": [
            "Assess the competence and objectivity of internal auditors before requesting their assistance.",
            "Supervise, review, and evaluate the work performed by internal auditors when providing direct assistance.",
            "Ensure internal auditors are informed of their responsibilities and the objectives of the audit procedures.",
            "Ensure internal auditors are aware of all significant accounting and auditing issues identified during the audit."
        ]
    },
    {
        "rule_id": "PCAOB-2610-07",
        "standard": "AS 2610 - Initial Audits—Communications Between Predecessor and Successor Auditors",
        "description": "Successor auditor must inquire with predecessor auditor before accepting engagement.",
        "enforcement_guidelines": [
            "Make specific and reasonable inquiries regarding management's integrity.",
            "Inquire about disagreements with management on accounting principles or auditing procedures.",
            "Inquire about communications to audit committees regarding fraud or illegal acts.",
            "Inquire about the predecessor auditor's understanding of the reasons for the change of auditors."
        ]
    },
    {
        "rule_id": "PCAOB-2610-12",
        "standard": "AS 2610 - Initial Audits—Communications Between Predecessor and Successor Auditors",
        "description": "Successor auditor must obtain sufficient audit evidence regarding opening balances and consistency of accounting principles.",
        "enforcement_guidelines": [
            "Review predecessor auditor's report and working papers.",
            "Perform audit procedures on current period transactions to provide evidence about opening balances.",
            "Evaluate the consistency of accounting principles applied in the current period."
        ]
    },
    {
        "rule_id": "PCAOB-2610-21",
        "standard": "AS 2610 - Initial Audits—Communications Between Predecessor and Successor Auditors",
        "description": "Successor auditor must handle possible misstatements in predecessor-audited financial statements.",
        "enforcement_guidelines": [
            "Inform the predecessor auditor of discovered misstatements.",
            "Arrange for a discussion between the successor auditor, predecessor auditor, and client.",
            "Evaluate the implications of unresolved misstatements on the current engagement.",
            "Consult with legal counsel if necessary."
        ]
    },
    {
        "rule_id": "PCAOB-2610",
        "standard": "AS 2610 - Initial Audits—Communications Between Predecessor and Successor Auditors",
        "description": "This standard outlines the communication requirements between predecessor and successor auditors during an initial audit. It emphasizes the importance of obtaining client consent for access to predecessor auditor's working papers and ensuring proper documentation of such communications.",
        "enforcement_guidelines": [
            "Request authorization from the client to review the predecessor auditor's working papers.",
            "Use the illustrative client consent and acknowledgment letter provided in Appendix A for documentation purposes.",
            "Obtain a written communication from the successor auditor regarding the use of the working papers before granting access.",
            "Confirm that the successor auditor agrees to the limitations on the use of the working papers as outlined in the standard."
        ]
    },
    {
        "rule_id": "PCAOB-2701",
        "standard": "AS 2701 - Auditing Supplemental Information Accompanying Audited Financial Statements",
        "description": "This standard establishes the auditor's responsibilities when auditing supplemental information that accompanies audited financial statements. The objective is to ensure that the supplemental information is fairly presented in relation to the audited financial statements.",
        "enforcement_guidelines": [
            "Perform audit procedures on the supplemental information to obtain sufficient appropriate audit evidence.",
            "Obtain management representations regarding the accuracy and completeness of the supplemental information.",
            "Evaluate the audit results and determine if the supplemental information is fairly stated in all material respects.",
            "Report on the fairness of the supplemental information in relation to the audited financial statements."
        ]
    },
    {
        "rule_id": "PCAOB-2701",
        "standard": "AS 2701 - Auditing Supplemental Information Accompanying Audited Financial Statements",
        "description": "This standard outlines the requirements for auditing supplemental information that accompanies audited financial statements, including the performance of audit procedures, obtaining management representations, and evaluating audit results.",
        "enforcement_guidelines": [
            "Perform audit procedures to obtain appropriate audit evidence that the supplemental information is fairly stated in relation to the financial statements as a whole.",
            "Obtain an understanding of the purpose, criteria, and methods used to prepare the supplemental information.",
            "Inquire of management about significant assumptions or interpretations underlying the measurement or presentation of the supplemental information.",
            "Determine that the supplemental information reconciles to the underlying accounting and other records or to the financial statements, as applicable.",
            "Perform procedures to test the completeness and accuracy of the information presented in the supplemental information.",
            "Evaluate whether the supplemental information complies with relevant regulatory requirements or other applicable criteria.",
            "Obtain written representations from management regarding their responsibility for the fair presentation of the supplemental information.",
            "Evaluate whether uncorrected misstatements related to the supplemental information are material, either individually or in combination with other misstatements.",
            "Evaluate the effect of any modifications to the audit report on the financial statements when forming an opinion on the supplemental information.",
            "Include specific statements in the auditor's report on the supplemental information, such as identification of the supplemental information, management's responsibility, and the nature of audit procedures performed."
        ]
    },
    {
        "rule_id": "PCAOB-2705",
        "standard": "AS 2705 - Required Supplementary Information",
        "description": "This standard establishes the auditor's responsibilities when required supplementary information accompanies audited financial statements. It outlines the procedures to be applied and the reporting requirements for such information.",
        "enforcement_guidelines": [
            "Determine if supplementary information is required by GAAP and accompanies the audited financial statements.",
            "Inquire of management about the methods of preparing the supplementary information, including measurement, presentation, and significant assumptions.",
            "Compare the supplementary information with the audited financial statements and other knowledge obtained during the audit.",
            "Consider including representations from management regarding the supplementary information.",
            "Apply additional procedures as prescribed by professional standards if necessary.",
            "Report on any omissions, material departures, or unresolved doubts regarding the supplementary information.",
            "Expand the audit report if the auditor performs additional procedures or expresses an opinion on the supplementary information."
        ]
    },
    {
        "rule_id": "PCAOB-2705",
        "standard": "AS 2705 - Required Supplementary Information",
        "description": "Guidance on handling supplementary information that is required by GAAP, including requirements for marking information as unaudited and including disclaimers in the auditor's report if necessary.",
        "enforcement_guidelines": [
            "Ensure that required supplementary information is clearly marked as unaudited if it is not part of the audited financial statements.",
            "If the supplementary information is not clearly marked as unaudited, expand the auditor's report to include a disclaimer regarding the supplementary information."
        ]
    },
    {
        "rule_id": "PCAOB-2710",
        "standard": "AS 2710 - Other Information in Documents Containing Audited Financial Statements",
        "description": "Guidance for auditors on their responsibilities regarding other information included in documents containing audited financial statements, including the need to read and consider such information for material inconsistencies.",
        "enforcement_guidelines": [
            "Read the other information included in the document for the purpose of identifying material inconsistencies with the financial statements.",
            "Evaluate whether the other information, or the manner of its presentation, is materially inconsistent with the financial statements.",
            "If a material inconsistency is identified, consider whether the financial statements, the auditor's report, or both require revision.",
            "If the other information is not revised to eliminate the material inconsistency, communicate the inconsistency to the audit committee and consider appropriate actions, such as revising the auditor's report to include an explanatory paragraph."
        ]
    },
    {
        "rule_id": "PCAOB-2801",
        "standard": "AS 2801 - Subsequent Events",
        "description": "Guidelines for handling subsequent events that may affect the fairness of financial statements.",
        "enforcement_guidelines": [
            "Examine interim financial statements to ensure consistency with the financial statements being audited.",
            "Inquire about significant changes in capital stock, long-term debt, or working capital.",
            "Obtain a written representation from management regarding subsequent events that may require adjustment or disclosure.",
            "Perform additional procedures to address any questions arising from the aforementioned inquiries."
        ]
    },
    {
        "rule_id": "PCAOB-2805",
        "standard": "AS 2805 - Management Representations",
        "description": "Requirements for obtaining written representations from management during an audit.",
        "enforcement_guidelines": [
            "Obtain written representations from management confirming their responsibility for the fair presentation of financial statements.",
            "Confirm that management believes the financial statements are fairly presented in accordance with generally accepted accounting principles.",
            "Ensure that written representations are provided to the audit committee if not already done by management."
        ]
    },
    {
        "rule_id": "PCAOB-2805-1",
        "standard": "AS 2805 - Management Representations",
        "description": "Management confirms that the financial statements are fairly presented in accordance with generally accepted accounting principles.",
        "enforcement_guidelines": [
            "Management must provide written confirmation of the fairness of the financial statements.",
            "The auditor should verify that the financial statements are prepared in accordance with GAAP."
        ]
    },
    {
        "rule_id": "PCAOB-2805-2",
        "standard": "AS 2805 - Management Representations",
        "description": "Management must provide all financial records, related party information, and meeting minutes.",
        "enforcement_guidelines": [
            "Management must provide all financial records and related data.",
            "Management must provide the names of all related parties and their transactions.",
            "Management must provide minutes of meetings of stockholders, directors, and committees."
        ]
    },
    {
        "rule_id": "PCAOB-2805-3",
        "standard": "AS 2805 - Management Representations",
        "description": "Management must report communications from regulatory agencies regarding noncompliance with financial reporting practices.",
        "enforcement_guidelines": [
            "Management must disclose any communications from regulatory agencies.",
            "The auditor should review any disclosed communications for materiality."
        ]
    },
    {
        "rule_id": "PCAOB-2805-4",
        "standard": "AS 2805 - Management Representations",
        "description": "Management must confirm the absence of unrecorded material transactions.",
        "enforcement_guidelines": [
            "Management must state that there are no unrecorded material transactions.",
            "The auditor should perform procedures to identify unrecorded transactions."
        ]
    },
    {
        "rule_id": "PCAOB-2805-5",
        "standard": "AS 2805 - Management Representations",
        "description": "Management must confirm the immateriality of uncorrected misstatements.",
        "enforcement_guidelines": [
            "Management must provide a summary of uncorrected misstatements.",
            "Management must confirm the immateriality of these misstatements."
        ]
    },
    {
        "rule_id": "PCAOB-2805-6",
        "standard": "AS 2805 - Management Representations",
        "description": "Management acknowledges responsibility for fraud prevention and detection programs.",
        "enforcement_guidelines": [
            "Management must acknowledge their responsibility for fraud prevention and detection.",
            "The auditor should assess the effectiveness of these programs."
        ]
    },
    {
        "rule_id": "PCAOB-2805-7",
        "standard": "AS 2805 - Management Representations",
        "description": "Management must report knowledge of fraud or suspected fraud involving specified individuals.",
        "enforcement_guidelines": [
            "Management must report any knowledge of fraud involving management or key employees.",
            "The auditor should investigate any reported instances of fraud."
        ]
    },
    {
        "rule_id": "PCAOB-2805-8",
        "standard": "AS 2805 - Management Representations",
        "description": "Management must report allegations of fraud received from specified sources.",
        "enforcement_guidelines": [
            "Management must report any allegations of fraud received from employees, former employees, analysts, regulators, short sellers, or others.",
            "The auditor should review any reported allegations."
        ]
    },
    {
        "rule_id": "PCAOB-2805-9",
        "standard": "AS 2805 - Management Representations",
        "description": "Management must report plans or intentions that may affect asset or liability values or classifications.",
        "enforcement_guidelines": [
            "Management must disclose any plans or intentions that may affect asset or liability values or classifications.",
            "The auditor should assess the impact of these plans or intentions on the financial statements."
        ]
    },
    {
        "rule_id": "PCAOB-2805-10",
        "standard": "AS 2805 - Management Representations",
        "description": "Management must report knowledge of any unasserted claims or assessments that are required to be accrued or disclosed.",
        "enforcement_guidelines": [
            "Management must report any knowledge of unasserted claims or assessments.",
            "The auditor should verify the disclosure of such claims or assessments."
        ]
    },
    {
        "rule_id": "PCAOB-2805-08",
        "standard": "AS 2805 - Management Representations",
        "description": "Management confirms that no subsequent events affecting the financial statements have occurred after the balance-sheet date.",
        "enforcement_guidelines": [
            "Management must confirm that no subsequent events have occurred that would require adjustment or disclosure in the financial statements."
        ]
    },
    {
        "rule_id": "PCAOB-2805-09",
        "standard": "AS 2805 - Management Representations",
        "description": "Management confirms that the company has complied with all aspects of contractual agreements that could materially affect the financial statements.",
        "enforcement_guidelines": [
            "Management must confirm compliance with all contractual agreements that could have a material effect on the financial statements."
        ]
    },
    {
        "rule_id": "PCAOB-2805-10",
        "standard": "AS 2805 - Management Representations",
        "description": "Management confirms that certain transactions and liabilities are properly recorded or disclosed in the financial statements.",
        "enforcement_guidelines": [
            "Management must confirm that related-party transactions, guarantees, contingent liabilities, and other matters are properly recorded or disclosed."
        ]
    },
    {
        "rule_id": "PCAOB-2805-11",
        "standard": "AS 2805 - Management Representations",
        "description": "Management confirms that there are no violations of laws or regulations that should be disclosed or recorded as a loss contingency.",
        "enforcement_guidelines": [
            "Management must confirm that there are no violations or possible violations of laws or regulations that should be disclosed or recorded as a loss contingency."
        ]
    },
    {
        "rule_id": "PCAOB-2805-12",
        "standard": "AS 2805 - Management Representations",
        "description": "Management confirms that the company has satisfactory title to all owned assets and there are no liens or encumbrances.",
        "enforcement_guidelines": [
            "Management must confirm that the company has satisfactory title to all owned assets and there are no liens or encumbrances on such assets."
        ]
    },
    {
        "rule_id": "PCAOB-2805-13",
        "standard": "AS 2805 - Management Representations",
        "description": "Management confirms that the company has complied with all aspects of contractual agreements that could materially affect the financial statements.",
        "enforcement_guidelines": [
            "Management must confirm compliance with all contractual agreements that could have a material effect on the financial statements."
        ]
    },
    {
        "rule_id": "PCAOB-2805-01",
        "standard": "AS 2805 - Management Representations",
        "description": "Management's responsibility to provide accurate representations regarding deferred tax assets and liabilities.",
        "enforcement_guidelines": [
            "Assess whether management has appropriately considered the need for a valuation allowance against deferred tax assets.",
            "Verify that management's representations regarding deferred tax assets are consistent with the financial statements and disclosures."
        ]
    },
    {
        "rule_id": "PCAOB-2805-02",
        "standard": "AS 2805 - Management Representations",
        "description": "Management's responsibility to provide accurate representations regarding short-term obligations refinanced on a long-term basis.",
        "enforcement_guidelines": [
            "Review the refinancing agreements and confirm that they have been properly disclosed in the financial statements.",
            "Assess whether management's intention to refinance short-term obligations on a long-term basis is reasonable and supported by appropriate evidence."
        ]
    },
    {
        "rule_id": "PCAOB-2805-03",
        "standard": "AS 2805 - Management Representations",
        "description": "Management's responsibility to provide accurate representations regarding tax-exempt bonds.",
        "enforcement_guidelines": [
            "Confirm that tax-exempt bonds have retained their tax-exempt status as represented by management.",
            "Review the financial statements to ensure proper disclosure of the tax-exempt status of the bonds."
        ]
    },
    {
        "rule_id": "PCAOB-2805-04",
        "standard": "AS 2805 - Management Representations",
        "description": "Management's responsibility to provide accurate representations regarding sales and purchase commitments.",
        "enforcement_guidelines": [
            "Assess whether provisions have been made for potential losses from sales and purchase commitments.",
            "Review the financial statements to ensure that all relevant sales and purchase commitments are properly disclosed and accounted for."
        ]
    },
    {
        "rule_id": "PCAOB-2805-05",
        "standard": "AS 2805 - Management Representations",
        "description": "Management's responsibility to provide accurate representations regarding litigation, claims, and assessments.",
        "enforcement_guidelines": [
            "Confirm that management has disclosed all pending or threatened litigation, claims, or assessments that could impact the financial statements.",
            "Review the legal documentation and management's representations to ensure that all relevant information has been provided to the auditor."
        ]
    },
    {
        "rule_id": "PCAOB-2810",
        "standard": "AS 2810 - Evaluating Audit Results",
        "description": "This standard establishes requirements for auditors to evaluate the results of their audits, including the sufficiency and appropriateness of audit evidence, and to determine whether the financial statements are presented fairly in all material respects.",
        "enforcement_guidelines": [
            "Accumulate misstatements identified during the audit, excluding those that are clearly trivial.",
            "Evaluate the materiality of uncorrected misstatements, considering both quantitative and qualitative factors.",
            "Evaluate the effects of uncorrected misstatements detected in prior years and those detected in the current year that relate to prior years.",
            "Assess whether identified misstatements might be indicative of fraud and perform additional procedures if necessary.",
            "Communicate findings and implications of misstatements to management and other relevant parties."
        ]
    },
    {
        "rule_id": "PCAOB-2810.24",
        "standard": "AS 2810 - Evaluating Audit Results",
        "description": "Auditors must evaluate the qualitative aspects of the company's accounting practices, including potential bias in management's judgments about the amounts and disclosures in the financial statements.",
        "enforcement_guidelines": [
            "Identify and assess instances of selective correction of misstatements.",
            "Evaluate the use of adjusting entries that offset misstatements identified during the audit.",
            "Assess bias in the selection and application of accounting principles.",
            "Evaluate bias in accounting estimates and its impact on financial statements."
        ]
    },
    {
        "rule_id": "PCAOB-2810.26",
        "standard": "AS 2810 - Evaluating Audit Results",
        "description": "Auditors must conclude on whether sufficient appropriate audit evidence has been obtained to support their opinion on the financial statements.",
        "enforcement_guidelines": [
            "Evaluate the significance of uncorrected misstatements and their potential material effect on the financial statements.",
            "Assess the results of audit procedures performed, including whether the evidence obtained supports or contradicts management's assertions.",
            "Evaluate the appropriateness of the auditor's risk assessments and whether audit procedures need to be modified.",
            "Perform additional procedures if necessary to address identified risks or gaps in audit evidence."
        ]
    },
    {
        "rule_id": "PCAOB-2810",
        "standard": "AS 2810 - Evaluating Audit Results",
        "description": "This standard outlines the requirements for auditors to evaluate the results of their audits, including the consideration of various factors that could indicate material misstatements or fraud.",
        "enforcement_guidelines": [
            "Identify discrepancies in accounting records, including transactions not recorded in a complete or timely manner or improperly recorded as to amount, accounting period, classification, or company policy.",
            "Consider conflicting or missing evidence, including unsupported or unauthorized balances or transactions.",
            "Assess unusual relationships between the auditor and management, including management pressure on engagement team members, particularly in connection with the auditor's critical assessment of audit evidence or the resolution of potential disagreements with management.",
            "Evaluate unusual delays by management in providing requested information.",
            "Consider management's unwillingness to add or revise disclosures in the financial statements to make them more complete and transparent.",
            "Assess management's unwillingness to appropriately address significant deficiencies in internal control on a timely basis.",
            "Evaluate the significance of misstatements, including the effects of misclassifications between operating and non-operating income or recurring and non-recurring income items.",
            "Consider the definitive character of the misstatement, including the precision of an error that is objectively determinable as contrasted with a misstatement that unavoidably involves a degree of subjectivity through estimation, allocation, or uncertainty.",
            "Evaluate the motivation of management with respect to the misstatement, including indications of a possible pattern of bias by management when developing and accumulating accounting estimates.",
            "Consider the likelihood that a misstatement that is currently immaterial may have a material effect in future periods because of a cumulative effect."
        ]
    },
    {
        "rule_id": "PCAOB-2820",
        "standard": "AS 2820 - Evaluating Consistency of Financial Statements",
        "description": "Auditors must evaluate changes in accounting principles and their material effects on financial statements.",
        "enforcement_guidelines": [
            "Evaluate whether the change in accounting principle is a generally accepted accounting principle.",
            "Assess if the method of accounting for the change conforms to generally accepted accounting principles.",
            "Ensure adequate disclosure of the change in accounting principle.",
            "Justify if the alternative accounting principle is preferable.",
            "Add an explanatory paragraph in the auditor's report if the change has a material effect.",
            "Issue a qualified or adverse opinion if the change does not meet the criteria."
        ]
    },
    {
        "rule_id": "PCAOB-2820",
        "standard": "AS 2820 - Evaluating Consistency of Financial Statements",
        "description": "Auditors must recognize corrections of material misstatements in previously issued financial statements.",
        "enforcement_guidelines": [
            "Add an explanatory paragraph in the auditor's report for corrections of material misstatements.",
            "Include a statement that the previously issued financial statements have been restated for the correction of a misstatement in the respective period.",
            "Reference the note disclosure describing the correction of the misstatement.",
            "Ensure that the explanatory paragraph is included in the year of the correction and subsequent years until the correction is no longer material."
        ]
    },
    {
        "rule_id": "PCAOB-2820",
        "standard": "AS 2820 - Evaluating Consistency of Financial Statements",
        "description": "Guidance on including an explanatory paragraph in the auditor's report when financial statements are restated to correct a prior material misstatement.",
        "enforcement_guidelines": [
            "Include an explanatory paragraph when restating financial statements to correct a prior material misstatement.",
            "Do not repeat the explanatory paragraph in subsequent years unless the restatement continues to be relevant."
        ]
    },
    {
        "rule_id": "PCAOB-2901",
        "standard": "AS 2901 - Consideration of Omitted Procedures After the Report Date",
        "description": "Guidance on handling situations where an auditor omits an auditing procedure considered necessary at the time of the audit.",
        "enforcement_guidelines": [
            "Assess the importance of the omitted procedure to the ability to support the previously expressed opinion.",
            "Consult with an attorney to determine an appropriate course of action.",
            "If the omission impairs the ability to support the opinion, promptly apply the omitted procedure or alternative procedures."
        ]
    },
    {
        "rule_id": "PCAOB-2905",
        "standard": "AS 2905 - Subsequent Discovery of Facts Existing at the Date of the Auditor's Report",
        "description": "This standard outlines the auditor's responsibilities when discovering facts subsequent to the audit report date that could affect the financial statements or the auditor's report.",
        "enforcement_guidelines": [
            "Assess whether the newly discovered information would have affected the auditor's report if known at the report date.",
            "Advise the client to make appropriate disclosure of the newly discovered facts and their impact on the financial statements.",
            "If the client refuses to make necessary disclosures, notify regulatory agencies and persons relying on the financial statements that the auditor's report should no longer be relied upon."
        ]
    },
    {
        "rule_id": "PCAOB-3101",
        "standard": "AS 3101 - The Auditor's Report on an Audit of Financial Statements When the Auditor Expresses an Unqualified Opinion",
        "description": "This standard establishes the requirements for the content of the auditor's report when expressing an unqualified opinion on financial statements.",
        "enforcement_guidelines": [
            "Include the basic elements of the auditor's report, such as the auditor's name, address, and report date.",
            "Communicate critical audit matters relating to the audit of the current period's financial statements, unless such requirements do not apply.",
            "State that the auditor determined that there are no critical audit matters if applicable."
        ]
    },
    {
        "rule_id": "PCAOB-3101-01",
        "standard": "AS 3101 - The Auditor's Report on an Audit of Financial Statements When the Auditor Expresses an Unqualified Opinion",
        "description": "Auditors must determine and communicate critical audit matters in the auditor's report. A critical audit matter is a matter arising from the audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved especially challenging, subjective, or complex auditor judgment.",
        "enforcement_guidelines": [
            "Identify critical audit matters that were communicated or required to be communicated to the audit committee.",
            "Assess whether the matters relate to accounts or disclosures that are material to the financial statements.",
            "Determine if the matters involved especially challenging, subjective, or complex auditor judgment."
        ]
    },
    {
        "rule_id": "PCAOB-3101-02",
        "standard": "AS 3101 - The Auditor's Report on an Audit of Financial Statements When the Auditor Expresses an Unqualified Opinion",
        "description": "For each critical audit matter communicated in the auditor's report, the auditor must: (a) identify the critical audit matter; (b) describe the principal considerations that led the auditor to determine that the matter is a critical audit matter; (c) describe how the critical audit matter was addressed in the audit; and (d) refer to the relevant financial statement accounts or disclosures that relate to the critical audit matter.",
        "enforcement_guidelines": [
            "Identify each critical audit matter in the auditor's report.",
            "Describe the principal considerations that led to the determination of each critical audit matter.",
            "Explain how each critical audit matter was addressed during the audit.",
            "Reference the relevant financial statement accounts or disclosures related to each critical audit matter."
        ]
    },
    {
        "rule_id": "PCAOB-3101-03",
        "standard": "AS 3101 - The Auditor's Report on an Audit of Financial Statements When the Auditor Expresses an Unqualified Opinion",
        "description": "For each matter arising from the audit of the financial statements that was communicated or required to be communicated to the audit committee and relates to accounts or disclosures that are material to the financial statements, the auditor must document whether or not the matter was determined to be a critical audit matter and the basis for such determination.",
        "enforcement_guidelines": [
            "Document whether each matter communicated to the audit committee is a critical audit matter.",
            "Record the basis for determining whether a matter is a critical audit matter.",
            "Ensure documentation is maintained for each matter communicated to the audit committee."
        ]
    },
    {
        "rule_id": "PCAOB-3101A",
        "standard": "AS 3101 - The Auditor's Report on an Audit of Financial Statements When the Auditor Expresses an Unqualified Opinion",
        "description": "The auditor must communicate critical audit matters in the auditor's report if they meet the defined criteria.",
        "enforcement_guidelines": [
            "Identify critical audit matters that relate to accounts or disclosures material to the financial statements.",
            "Assess whether the matters involved especially challenging, subjective, or complex auditor judgment.",
            "Communicate critical audit matters in the auditor's report, ensuring they are clearly described and cross-referenced if necessary."
        ]
    },
    {
        "rule_id": "PCAOB-3101B",
        "standard": "AS 3101 - The Auditor's Report on an Audit of Financial Statements When the Auditor Expresses an Unqualified Opinion",
        "description": "The auditor may emphasize certain matters in the auditor's report if they are significant to the financial statements.",
        "enforcement_guidelines": [
            "Identify significant transactions, subsequent events, or other matters that require emphasis.",
            "Assess the materiality and significance of the matter to the financial statements.",
            "Draft an emphasis of matter paragraph to highlight the issue and ensure it is appropriately titled."
        ]
    },
    {
        "rule_id": "PCAOB-3101C",
        "standard": "AS 3101 - The Auditor's Report on an Audit of Financial Statements When the Auditor Expresses an Unqualified Opinion",
        "description": "The auditor must include information about the engagement partner and other accounting firms participating in the audit.",
        "enforcement_guidelines": [
            "Identify the engagement partner and other accounting firms contributing to the audit.",
            "Obtain the required information, including the firm's legal name, location, and percentage of total audit hours.",
            "Include the information in the auditor's report as specified, ensuring compliance with PCAOB standards."
        ]
    },
    {
        "rule_id": "PCAOB-3105-QO",
        "standard": "AS 3105 - Departures from Unqualified Opinions and Other Reporting Circumstances",
        "description": "Qualified opinions are required when there is a lack of sufficient appropriate evidential matter or restrictions on the scope of the audit that prevent the auditor from expressing an unqualified opinion.",
        "enforcement_guidelines": [
            "Assess the importance of omitted procedures and their impact on the financial statements.",
            "Describe the basis for the qualified opinion in a separate paragraph following the opinion paragraph.",
            "Ensure the opinion paragraph includes qualifying language referencing the effects on the financial statements."
        ]
    },
    {
        "rule_id": "PCAOB-3105-AO",
        "standard": "AS 3105 - Departures from Unqualified Opinions and Other Reporting Circumstances",
        "description": "An adverse opinion must be expressed when the financial statements do not present fairly in all material respects the financial position, results of operations, or cash flows of the entity in conformity with generally accepted accounting principles.",
        "enforcement_guidelines": [
            "Clearly state that the financial statements do not present fairly in all material respects.",
            "Provide detailed reasons for the adverse opinion in the report.",
            "Ensure the opinion paragraph explicitly states the adverse opinion."
        ]
    },
    {
        "rule_id": "PCAOB-3105-DO",
        "standard": "AS 3105 - Departures from Unqualified Opinions and Other Reporting Circumstances",
        "description": "A disclaimer of opinion is required when the auditor is unable to obtain sufficient appropriate evidential matter necessary to form an opinion on the financial statements as a whole.",
        "enforcement_guidelines": [
            "Clearly state that the auditor is unable to express an opinion on the financial statements as a whole.",
            "Provide detailed reasons for the disclaimer of opinion in the report.",
            "Ensure the opinion paragraph explicitly states the disclaimer of opinion."
        ]
    },
    {
        "rule_id": "PCAOB-3105.10",
        "standard": "AS 3105 - Departures from Unqualified Opinions and Other Reporting Circumstances",
        "description": "Auditors must address unaudited information that is material to the financial statements by applying necessary procedures. If unable to do so, they must qualify or disclaim the opinion.",
        "enforcement_guidelines": [
            "Identify and assess unaudited information that is material to the financial statements.",
            "Apply necessary auditing procedures to the unaudited information.",
            "If unable to obtain sufficient evidence, qualify or disclaim the opinion."
        ]
    },
    {
        "rule_id": "PCAOB-3105.11",
        "standard": "AS 3105 - Departures from Unqualified Opinions and Other Reporting Circumstances",
        "description": "Auditors must address uncertainties by assessing the sufficiency of evidential matter. If insufficient, qualify or disclaim the opinion.",
        "enforcement_guidelines": [
            "Assess the sufficiency of evidential matter related to uncertainties.",
            "If insufficient evidence, qualify or disclaim the opinion."
        ]
    },
    {
        "rule_id": "PCAOB-3105.18",
        "standard": "AS 3105 - Departures from Unqualified Opinions and Other Reporting Circumstances",
        "description": "Auditors must determine materiality of departures from GAAP to decide between qualified or adverse opinion.",
        "enforcement_guidelines": [
            "Assess the materiality of departures from GAAP.",
            "If material, express a qualified or adverse opinion.",
            "State the basis for the opinion in the report."
        ]
    },
    {
        "rule_id": "PCAOB-3105.20",
        "standard": "AS 3105 - Departures from Unqualified Opinions and Other Reporting Circumstances",
        "description": "Auditors must disclose reasons for qualified opinions and effects on financial statements.",
        "enforcement_guidelines": [
            "Disclose reasons for qualified opinions in the report.",
            "State the effects on financial statements if practicable.",
            "Refer to notes if information is already disclosed."
        ]
    },
    {
        "rule_id": "PCAOB-3105.24",
        "standard": "AS 3105 - Departures from Unqualified Opinions and Other Reporting Circumstances",
        "description": "Auditors must address inadequate disclosure in financial statements by qualifying or disclaiming the opinion.",
        "enforcement_guidelines": [
            "Assess if required information is missing from financial statements.",
            "If inadequate disclosure, qualify or disclaim the opinion.",
            "Provide necessary information in the report if practicable."
        ]
    },
    {
        "rule_id": "PCAOB-3105-26",
        "standard": "AS 3105 - Departures from Unqualified Opinions and Other Reporting Circumstances",
        "description": "Omission of the statement of cash flows requires qualification of the auditor's opinion.",
        "enforcement_guidelines": [
            "Assess whether the omission of the statement of cash flows is material.",
            "Determine if the omission affects the fairness of the financial statements.",
            "Modify the opinion to reflect the omission and its materiality."
        ]
    },
    {
        "rule_id": "PCAOB-3105-27",
        "standard": "AS 3105 - Departures from Unqualified Opinions and Other Reporting Circumstances",
        "description": "Inadequate disclosure of risks or uncertainties requires a qualified or adverse opinion.",
        "enforcement_guidelines": [
            "Evaluate the adequacy of disclosure of risks or uncertainties.",
            "Assess the materiality of the inadequate disclosure.",
            "Express a qualified or adverse opinion based on the materiality."
        ]
    },
    {
        "rule_id": "PCAOB-3105-28",
        "standard": "AS 3105 - Departures from Unqualified Opinions and Other Reporting Circumstances",
        "description": "Departures from GAAP in changes of accounting principles require qualification or adverse opinion.",
        "enforcement_guidelines": [
            "Determine if the change in accounting principle is justified.",
            "Assess the materiality of the departure from GAAP.",
            "Express a qualified or adverse opinion based on the materiality."
        ]
    },
    {
        "rule_id": "PCAOB-3105-31",
        "standard": "AS 3105 - Departures from Unqualified Opinions and Other Reporting Circumstances",
        "description": "Inappropriate accounting principles require a qualified or adverse opinion.",
        "enforcement_guidelines": [
            "Evaluate the appropriateness of the accounting principles used.",
            "Assess the materiality of the departure from GAAP.",
            "Express a qualified or adverse opinion based on the materiality."
        ]
    },
    {
        "rule_id": "PCAOB-3105-32",
        "standard": "AS 3105 - Departures from Unqualified Opinions and Other Reporting Circumstances",
        "description": "Unreasonable accounting estimates require a qualified or adverse opinion.",
        "enforcement_guidelines": [
            "Evaluate the reasonableness of management's estimates.",
            "Assess the materiality of the departure from GAAP.",
            "Express a qualified or adverse opinion based on the materiality."
        ]
    },
    {
        "rule_id": "PCAOB-3105-34",
        "standard": "AS 3105 - Departures from Unqualified Opinions and Other Reporting Circumstances",
        "description": "Departures from GAAP in changes of accounting principles require qualification or adverse opinion in subsequent years.",
        "enforcement_guidelines": [
            "Evaluate the impact of the accounting change on subsequent years.",
            "Assess the materiality of the departure from GAAP.",
            "Express a qualified or adverse opinion based on the materiality."
        ]
    },
    {
        "rule_id": "PCAOB-3105-40",
        "standard": "AS 3105 - Departures from Unqualified Opinions and Other Reporting Circumstances",
        "description": "Adverse opinions must state that financial statements do not present fairly in conformity with GAAP.",
        "enforcement_guidelines": [
            "State that the financial statements do not present fairly in conformity with GAAP.",
            "Disclose the reasons for the adverse opinion.",
            "Explain the effects of the adverse opinion on financial position, results of operations, and cash flows."
        ]
    },
    {
        "rule_id": "PCAOB-3105-44",
        "standard": "AS 3105 - Departures from Unqualified Opinions and Other Reporting Circumstances",
        "description": "Guidelines for disclaiming an opinion when sufficient audit evidence cannot be obtained.",
        "enforcement_guidelines": [
            "Identify and clearly state the scope limitation that prevents obtaining sufficient appropriate audit evidence.",
            "State that the scope of the audit was not sufficient to warrant the expression of an opinion.",
            "Omit the paragraph describing the characteristics of an audit (scope paragraph) to avoid overshadowing the disclaimer."
        ]
    },
    {
        "rule_id": "PCAOB-3105-48",
        "standard": "AS 3105 - Departures from Unqualified Opinions and Other Reporting Circumstances",
        "description": "Prohibition of piecemeal opinions when disclaiming or expressing an adverse opinion on financial statements taken as a whole.",
        "enforcement_guidelines": [
            "Do not express piecemeal opinions (opinions on specific items) when disclaiming an opinion or expressing an adverse opinion on the financial statements as a whole."
        ]
    },
    {
        "rule_id": "PCAOB-3105.52",
        "standard": "AS 3105 - Departures from Unqualified Opinions and Other Reporting Circumstances",
        "description": "Guidelines for updating reports when prior-period financial statements are restated.",
        "enforcement_guidelines": [
            "Identify circumstances or events affecting prior-period financial statements.",
            "Assess whether restatement is necessary for compliance with accounting principles.",
            "Communicate changes in opinion to stakeholders."
        ]
    },
    {
        "rule_id": "PCAOB-3105.53",
        "standard": "AS 3105 - Departures from Unqualified Opinions and Other Reporting Circumstances",
        "description": "Requirements when the opinion on prior-period financial statements differs from the previous opinion.",
        "enforcement_guidelines": [
            "Compare prior-period financial statements with current-period statements.",
            "Obtain representations from management regarding prior-period statements.",
            "Evaluate findings from the successor auditor."
        ]
    },
    {
        "rule_id": "PCAOB-3105.58",
        "standard": "AS 3105 - Departures from Unqualified Opinions and Other Reporting Circumstances",
        "description": "Guidelines for reporting when the predecessor auditor's report is not presented.",
        "enforcement_guidelines": [
            "Describe the nature of the predecessor auditor's report.",
            "Explain the reasons for the different opinion.",
            "Include a paragraph about adjustments if applicable."
        ]
    },
    {
        "rule_id": "PCAOB-3105",
        "standard": "AS 3105 - Departures from Unqualified Opinions and Other Reporting Circumstances",
        "description": "Requirements for including specific statements in the auditor's report when there is a departure from an unqualified opinion.",
        "enforcement_guidelines": [
            "Include statements in the auditor's report that the company is not required to have an audit of internal control over financial reporting.",
            "State that the auditor was not engaged to perform such an audit.",
            "Indicate that the auditor expresses no opinion on the effectiveness of internal control over financial reporting."
        ]
    },
    {
        "rule_id": "PCAOB-3110",
        "standard": "AS 3110 - Dating of the Independent Auditor's Report",
        "description": "Guidelines for dating the auditor's report and handling subsequent events.",
        "enforcement_guidelines": [
            "Date the audit report no earlier than the date sufficient appropriate evidence is obtained.",
            "Use dual dating if subsequent events require adjustments or disclosures after the original report date.",
            "Consider the effect of subsequent events on the opinion and date the report accordingly."
        ]
    },
    {
        "rule_id": "PCAOB-3305-05",
        "standard": "AS 3305 - Special Reports",
        "description": "Requirements for auditors when financial statements are prepared in conformity with a comprehensive basis of accounting other than generally accepted accounting principles.",
        "enforcement_guidelines": [
            "Include a title that includes the word 'independent'.",
            "State that the financial statements are the responsibility of management and that the auditor is responsible for expressing an opinion based on the audit.",
            "Conduct the audit in accordance with PCAOB standards and include an identification of the United States of America as the country of origin of those standards.",
            "Express an opinion (or disclaimer of opinion) on whether the financial statements are presented fairly, in all material respects, in conformity with the basis of accounting described.",
            "If applicable, include a separate paragraph stating that the report is intended solely for the information and use of those within the entity and the regulatory agencies to whose jurisdiction the entity is subject."
        ]
    },
    {
        "rule_id": "PCAOB-3305-11",
        "standard": "AS 3305 - Special Reports",
        "description": "Requirements for auditors when reporting on specified elements, accounts, or items of a financial statement.",
        "enforcement_guidelines": [
            "Assess whether the specified elements, accounts, or items are presented fairly, in all material respects, in conformity with the applicable basis of accounting.",
            "Consider the basis of accounting used in the financial statements.",
            "Include a paragraph in the report stating that the auditor's opinion is limited to the specified elements, accounts, or items and that the financial statements as a whole are not audited."
        ]
    },
    {
        "rule_id": "PCAOB-3305-19",
        "standard": "AS 3305 - Special Reports",
        "description": "Requirements for auditors when reporting on compliance with aspects of contractual agreements or regulatory requirements related to audited financial statements.",
        "enforcement_guidelines": [
            "Obtain written assertions from management regarding compliance with the specified aspects of contractual agreements or regulatory requirements.",
            "Perform audit procedures to obtain sufficient appropriate audit evidence regarding compliance with the specified aspects.",
            "Include a paragraph in the report stating that the auditor has examined the financial statements and related schedules and that the financial statements comply with the specified aspects of contractual agreements or regulatory requirements."
        ]
    },
    {
        "rule_id": "PCAOB-3305-22",
        "standard": "AS 3305 - Special Reports",
        "description": "Requirements for auditors when reporting on special-purpose financial presentations to comply with contractual agreements or regulatory provisions.",
        "enforcement_guidelines": [
            "Assess whether the financial statements are presented fairly, in all material respects, in conformity with the basis of accounting described.",
            "Consider the basis of accounting used in the financial statements.",
            "Include a paragraph in the report stating that the auditor's opinion is limited to the specified elements, accounts, or items and that the financial statements as a whole are not audited."
        ]
    },
    {
        "rule_id": "PCAOB-3305-06",
        "standard": "AS 3305 - Special Reports",
        "description": "Auditors must modify their report if financial statements do not meet the conditions for presentation in conformity with a comprehensive basis of accounting other than generally accepted accounting principles.",
        "enforcement_guidelines": [
            "Verify if the financial statements meet the conditions for presentation in conformity with a comprehensive basis of accounting other than GAAP.",
            "Modify the auditor's report if the financial statements do not meet the required conditions."
        ]
    },
    {
        "rule_id": "PCAOB-3305-07",
        "standard": "AS 3305 - Special Reports",
        "description": "Auditors must ensure that financial statements are suitably titled when prepared on a basis other than GAAP.",
        "enforcement_guidelines": [
            "Review the titles of the financial statements to ensure they are appropriate and clearly indicate the basis of accounting used.",
            "Modify the auditor's report if the titles are deemed misleading or inappropriate."
        ]
    },
    {
        "rule_id": "PCAOB-3305-09",
        "standard": "AS 3305 - Special Reports",
        "description": "Auditors must evaluate the adequacy of disclosure in financial statements prepared on a basis other than GAAP.",
        "enforcement_guidelines": [
            "Review the financial statements and accompanying notes to ensure they include all necessary informative disclosures.",
            "Assess whether the disclosures are clear, complete, and appropriate for the basis of accounting used.",
            "Modify the auditor's report if the disclosures are found to be inadequate."
        ]
    },
    {
        "rule_id": "PCAOB-3305-12",
        "standard": "AS 3305 - Special Reports",
        "description": "Auditors must plan and perform the audit to express an opinion on specified elements, accounts, or items of a financial statement.",
        "enforcement_guidelines": [
            "Plan and perform the audit with a focus on the specified elements, accounts, or items.",
            "Ensure that the specified elements, accounts, or items are presented in conformity with GAAP if applicable.",
            "Follow the requirements of AS 3101 and AS 3105 when expressing an opinion on specified elements, accounts, or items."
        ]
    },
    {
        "rule_id": "PCAOB-3305-15",
        "standard": "AS 3305 - Special Reports",
        "description": "Auditors must include specific elements in their report when expressing an opinion on one or more specified elements, accounts, or items of a financial statement.",
        "enforcement_guidelines": [
            "Include a title that indicates the independence of the auditor.",
            "State that the specified elements, accounts, or items are the responsibility of management.",
            "Explain that the auditor is responsible for expressing an opinion on the specified elements, accounts, or items based on the audit.",
            "Include a paragraph stating that the audit was conducted in accordance with PCAOB standards.",
            "Include a paragraph stating that the standards require the auditor to plan and perform the audit to obtain reasonable assurance about whether the specified elements, accounts, or items are free of material misstatement."
        ]
    },
    {
        "rule_id": "PCAOB-3305A",
        "standard": "AS 3305 - Special Reports",
        "description": "Requirements for reports on specified elements, accounts, or items of financial statements.",
        "enforcement_guidelines": [
            "Include an opinion paragraph expressing whether the specified elements, accounts, or items are fairly presented in all material respects.",
            "Include a paragraph explaining the basis of accounting used for the presentation.",
            "Include a restriction on the use of the report if the presentation is based on a contract or agreement.",
            "Include the auditor's signature, city and state/country, and date in the report."
        ]
    },
    {
        "rule_id": "PCAOB-3305B",
        "standard": "AS 3305 - Special Reports",
        "description": "Requirements for audits of specified elements, accounts, or items based on a contract or agreement.",
        "enforcement_guidelines": [
            "Assess the accounting principles used and significant estimates made by management.",
            "Evaluate the overall presentation of the specified elements, accounts, or items.",
            "Include a paragraph explaining the basis of accounting used for the presentation.",
            "Include a restriction on the use of the report if the presentation is based on a contract or agreement."
        ]
    },
    {
        "rule_id": "PCAOB-3305",
        "standard": "AS 3305 - Special Reports",
        "description": "Requirements for auditors when providing reports on compliance with contractual agreements or regulatory provisions related to audited financial statements.",
        "enforcement_guidelines": [
            "Include a title that includes the word 'independent'.",
            "State that the financial statements were audited in accordance with PCAOB standards and identify the United States as the country of origin of those standards.",
            "Provide negative assurance relative to compliance with applicable covenants insofar as they relate to accounting matters, and state that the audit was not directed primarily toward obtaining knowledge of noncompliance.",
            "Include a paragraph restricting the use of the report to specified parties.",
            "Sign and date the report with the auditor's firm's manual or printed signature."
        ]
    },
    {
        "rule_id": "PCAOB-3305",
        "standard": "AS 3305 - Special Reports",
        "description": "Requirements for auditors when issuing reports on special-purpose financial statements.",
        "enforcement_guidelines": [
            "Include a title that includes the word 'independent'.",
            "State that the special-purpose financial statements were audited.",
            "State that the financial statements are the responsibility of the entity's management.",
            "State that the auditor is responsible for expressing an opinion on the financial statements based on the audit.",
            "State that the audit was conducted in accordance with PCAOB standards.",
            "Include a paragraph that explains the basis of presentation and that the presentation is not intended to be a presentation in conformity with generally accepted accounting principles.",
            "Include a paragraph that expresses the auditor's opinion or disclaimer of opinion.",
            "Include a paragraph that restricts the use of the report to specified parties.",
            "Include the manual or printed signature of the auditor's firm.",
            "Include the city and state (or city and country, for non-U.S. auditors) from which the report was issued.",
            "Include the date."
        ]
    },
    {
        "rule_id": "PCAOB-3305a",
        "standard": "AS 3305 - Special Reports",
        "description": "Auditors must add an explanatory paragraph if there is a change in accounting principles or their application, referencing the note discussing the change and its effects.",
        "enforcement_guidelines": [
            "Identify changes in accounting principles or their application.",
            "Add an explanatory paragraph with an appropriate title immediately following the opinion paragraph.",
            "Reference the note discussing the change and its effects in the financial statements."
        ]
    },
    {
        "rule_id": "PCAOB-3305b",
        "standard": "AS 3305 - Special Reports",
        "description": "Auditors must add an explanatory paragraph if there is substantial doubt about the entity's ability to continue as a going concern for a reasonable period.",
        "enforcement_guidelines": [
            "Assess substantial doubt about the entity's ability to continue as a going concern.",
            "Add an explanatory paragraph with an appropriate title after the opinion paragraph if substantial doubt is relevant."
        ]
    },
    {
        "rule_id": "PCAOB-3305c",
        "standard": "AS 3305 - Special Reports",
        "description": "Auditors must reference the audit and report of another public accounting firm when dividing audit responsibility.",
        "enforcement_guidelines": [
            "Identify situations where audit responsibility is divided with another firm.",
            "Reference the audit and report of the referred-to auditor in compliance with AS 1206."
        ]
    },
    {
        "rule_id": "PCAOB-3305d",
        "standard": "AS 3305 - Special Reports",
        "description": "Auditors must disclose reasons for a different opinion on prior-period financial statements in an explanatory paragraph.",
        "enforcement_guidelines": [
            "Identify if the opinion on prior-period financial statements differs from previous opinions.",
            "Disclose all substantive reasons for the different opinion in a separate explanatory paragraph immediately following the opinion paragraph."
        ]
    },
    {
        "rule_id": "PCAOB-3310",
        "standard": "AS 3310 - Special Reports on Regulated Companies",
        "description": "Guidance for auditors when financial statements of regulated companies are prepared under a prescribed basis of accounting different from GAAP.",
        "enforcement_guidelines": [
            "Assess whether the financial statements comply with the prescribed basis of accounting.",
            "Modify the auditor's report to reflect departures from GAAP.",
            "Ensure the report clearly communicates the basis of accounting used."
        ]
    },
    {
        "rule_id": "PCAOB-3315",
        "standard": "AS 3315 - Reporting on Condensed Financial Statements and Selected Financial Data",
        "description": "Guidance for auditors when reporting on condensed financial statements derived from audited financial statements.",
        "enforcement_guidelines": [
            "Review condensed financial statements for fairness and material accuracy.",
            "Ensure the report includes a reference to the complete audited financial statements.",
            "Include a statement that the condensed statements are fairly derived from the audited statements."
        ]
    },
    {
        "rule_id": "PCAOB-3315",
        "standard": "AS 3315 - Reporting on Condensed Financial Statements and Selected Financial Data",
        "description": "Guidelines for auditors when reporting on selected financial data derived from audited financial statements.",
        "enforcement_guidelines": [
            "State that the auditor has audited the complete financial statements and express an opinion on them.",
            "Specify the selected financial data on which the auditor is reporting.",
            "Indicate that the information set forth in the selected financial data is fairly stated, in all material respects, in relation to the complete financial statements from which it has been derived.",
            "If selected financial data for any of the years presented are derived from financial statements audited by another independent auditor, state that fact and do not express an opinion on that data."
        ]
    },
    {
        "rule_id": "PCAOB-3320-05",
        "standard": "AS 3320 - Association with Financial Statements",
        "description": "An accountant must disclaim an opinion when associated with unaudited financial statements of a public entity.",
        "enforcement_guidelines": [
            "Issue a disclaimer of opinion stating that the financial statements were not audited or reviewed.",
            "Clearly mark each page of the financial statements as 'unaudited'.",
            "Do not describe any procedures performed beyond reading the financial statements for obvious material misstatements."
        ]
    },
    {
        "rule_id": "PCAOB-3320-06",
        "standard": "AS 3320 - Association with Financial Statements",
        "description": "An accountant must disclaim an opinion and state lack of independence when associated with financial statements of a public entity when not independent.",
        "enforcement_guidelines": [
            "Modify the disclaimer of opinion to specifically state that the accountant is not independent.",
            "Do not describe the reasons for lack of independence or any procedures performed.",
            "Refuse to be associated with the financial statements if the client does not comply with the requirements."
        ]
    },
    {
        "rule_id": "PCAOB-3320-07",
        "standard": "AS 3320 - Association with Financial Statements",
        "description": "An accountant must describe departures from generally accepted accounting principles in the disclaimer of opinion when associated with unaudited financial statements of a public entity.",
        "enforcement_guidelines": [
            "Suggest appropriate revisions to the financial statements to conform with GAAP.",
            "Modify the disclaimer of opinion to describe the nature of the departure from GAAP.",
            "Refuse to be associated with the financial statements if the client does not revise them to conform with GAAP."
        ]
    },
    {
        "rule_id": "PCAOB-3320-18",
        "standard": "AS 3320 - Association with Financial Statements",
        "description": "An accountant must not include negative assurances in a disclaimer of opinion on unaudited financial statements.",
        "enforcement_guidelines": [
            "Avoid including negative assurances in the disclaimer of opinion.",
            "Ensure that the disclaimer of opinion does not contradict the lack of opinion expressed."
        ]
    },
    {
        "rule_id": "PCAOB-4101.01",
        "standard": "AS 4101 - Responsibilities Regarding Filings Under Federal Securities Statutes",
        "description": "Management is responsible for the financial representations contained in documents filed under federal securities statutes. The independent accountant's report serves as a check on management's stewardship but does not absolve management of its primary responsibility.",
        "enforcement_guidelines": [
            "Ensure that management acknowledges its responsibility for the accuracy of financial statements.",
            "Verify that the independent accountant's report is properly referenced and does not imply greater responsibility than intended."
        ]
    },
    {
        "rule_id": "PCAOB-4101.02",
        "standard": "AS 4101 - Responsibilities Regarding Filings Under Federal Securities Statutes",
        "description": "Independent accountants have specific responsibilities when their reports are included in registration statements under the Securities Act of 1933. They must ensure their reports are not misrepresented in the filings.",
        "enforcement_guidelines": [
            "Review the prospectus and registration statement to ensure the independent accountant's report is accurately referenced.",
            "Ensure that the prospectus does not imply that the independent accountant is responsible for unaudited interim financial information."
        ]
    },
    {
        "rule_id": "PCAOB-4101.03",
        "standard": "AS 4101 - Responsibilities Regarding Filings Under Federal Securities Statutes",
        "description": "Independent accountants must perform a reasonable investigation to fulfill their statutory responsibilities under the Securities Act of 1933. This includes procedures to identify subsequent events that could affect the financial statements.",
        "enforcement_guidelines": [
            "Perform procedures to identify subsequent events from the date of the audit report to the effective date of the registration statement.",
            "Document the procedures performed and the conclusions reached regarding subsequent events."
        ]
    },
    {
        "rule_id": "PCAOB-4101.04",
        "standard": "AS 4101 - Responsibilities Regarding Filings Under Federal Securities Statutes",
        "description": "Independent accountants who have audited prior-period financial statements included in a registration statement must address subsequent events that could affect those prior-period financial statements.",
        "enforcement_guidelines": [
            "Review pertinent portions of the prospectus and registration statement related to prior-period financial statements.",
            "Obtain representations from the successor auditor regarding subsequent events that could affect the prior-period financial statements."
        ]
    },
    {
        "rule_id": "PCAOB-4105-01",
        "standard": "AS 4105 - Reviews of Interim Financial Information",
        "description": "Establishes standards and provides guidance on the nature, timing, and extent of procedures for reviewing interim financial information.",
        "enforcement_guidelines": [
            "Conduct reviews in accordance with PCAOB standards.",
            "Ensure reviews are designed to identify material modifications needed for interim financial information to conform with GAAP."
        ]
    },
    {
        "rule_id": "PCAOB-4105-05",
        "standard": "AS 4105 - Reviews of Interim Financial Information",
        "description": "Specifies the applicability of the review of interim financial information for SEC registrants and non-SEC registrants.",
        "enforcement_guidelines": [
            "Ensure the review is conducted for SEC registrants.",
            "Conduct reviews for non-SEC registrants making filings with regulatory agencies."
        ]
    },
    {
        "rule_id": "PCAOB-4105-07",
        "standard": "AS 4105 - Reviews of Interim Financial Information",
        "description": "Sets the objective of a review of interim financial information to provide a basis for communicating whether material modifications are needed.",
        "enforcement_guidelines": [
            "Perform analytical procedures and make inquiries to identify material modifications.",
            "Communicate findings to management and the audit committee."
        ]
    },
    {
        "rule_id": "PCAOB-4105-08",
        "standard": "AS 4105 - Reviews of Interim Financial Information",
        "description": "Requires establishing an understanding with the audit committee regarding the terms of the engagement for reviewing interim financial information.",
        "enforcement_guidelines": [
            "Document the understanding in an engagement letter.",
            "Ensure the engagement letter is executed by the appropriate parties."
        ]
    },
    {
        "rule_id": "PCAOB-4105-12",
        "standard": "AS 4105 - Reviews of Interim Financial Information",
        "description": "The accountant must perform analytical procedures to identify unusual relationships and items that may indicate a material misstatement in the interim financial information.",
        "enforcement_guidelines": [
            "Compare the quarterly interim financial information with comparable information for the immediately preceding interim period and the corresponding period in the prior year.",
            "Consider plausible relationships among both financial and nonfinancial information.",
            "Develop expectations based on the entity's business and industry context."
        ]
    },
    {
        "rule_id": "PCAOB-4105-15",
        "standard": "AS 4105 - Reviews of Interim Financial Information",
        "description": "The accountant must perform specific inquiries and review procedures to ensure the accuracy and completeness of interim financial information.",
        "enforcement_guidelines": [
            "Read the available minutes of meetings of stockholders, directors, and appropriate committees.",
            "Obtain reports from other accountants regarding significant components of the reporting entity.",
            "Inquire of management about the conformity of interim financial information with GAAP.",
            "Read other information accompanying the interim financial information to check for material inconsistencies.",
            "Evaluate management's quarterly certifications about internal control over financial reporting."
        ]
    },
    {
        "rule_id": "PCAOB-4105-18",
        "standard": "AS 4105 - Reviews of Interim Financial Information",
        "description": "The accountant must evaluate management's quarterly certifications about internal control over financial reporting.",
        "enforcement_guidelines": [
            "Inquire of management about significant changes in the design or operation of internal control over financial reporting.",
            "Evaluate the implications of misstatements identified during the review procedures.",
            "Determine whether changes in internal control have a material effect on the company's internal control over financial reporting."
        ]
    },
    {
        "rule_id": "PCAOB-4105-22",
        "standard": "AS 4105 - Reviews of Interim Financial Information",
        "description": "Extension of interim review procedures to identify and address potential misstatements in interim financial information.",
        "enforcement_guidelines": [
            "Identify and assess potential misstatements in interim financial information.",
            "Perform additional procedures to resolve questions about conformity with GAAP.",
            "Accumulate and evaluate likely misstatements identified during the review."
        ]
    },
    {
        "rule_id": "PCAOB-4105-23",
        "standard": "AS 4105 - Reviews of Interim Financial Information",
        "description": "Coordination of interim review procedures with the annual audit to ensure consistency and efficiency.",
        "enforcement_guidelines": [
            "Coordinate interim review procedures with the annual audit where appropriate.",
            "Use information from interim reviews to inform the annual audit process.",
            "Document coordination efforts and any significant findings."
        ]
    },
    {
        "rule_id": "PCAOB-4105-24",
        "standard": "AS 4105 - Reviews of Interim Financial Information",
        "description": "Evaluation of the results of interim review procedures to determine materiality of misstatements.",
        "enforcement_guidelines": [
            "Evaluate misstatements individually and in the aggregate.",
            "Consider the nature, cause, and amount of misstatements.",
            "Document the evaluation and any conclusions regarding materiality."
        ]
    },
    {
        "rule_id": "PCAOB-4105-29",
        "standard": "AS 4105 - Reviews of Interim Financial Information",
        "description": "Communication of material modifications and other significant matters to management and the audit committee.",
        "enforcement_guidelines": [
            "Communicate material modifications to interim financial information to management.",
            "Provide timely communication to the audit committee if management does not respond appropriately.",
            "Document all communications with management and the audit committee."
        ]
    },
    {
        "rule_id": "PCAOB-4105-32",
        "standard": "AS 4105 - Reviews of Interim Financial Information",
        "description": "Consideration of fraud and illegal acts during the review of interim financial information.",
        "enforcement_guidelines": [
            "Assess the risk of fraud or illegal acts affecting the interim financial information.",
            "Communicate findings related to fraud or illegal acts to the audit committee.",
            "Document all considerations and communications related to fraud and illegal acts."
        ]
    },
    {
        "rule_id": "PCAOB-4105-37",
        "standard": "AS 4105 - Reviews of Interim Financial Information",
        "description": "The accountant's review report must include the title 'Report of Independent Registered Public Accounting Firm'.",
        "enforcement_guidelines": [
            "Ensure the report title is correctly formatted as 'Report of Independent Registered Public Accounting Firm'."
        ]
    },
    {
        "rule_id": "PCAOB-4105-37A",
        "standard": "AS 4105 - Reviews of Interim Financial Information",
        "description": "The review report must be addressed to shareholders and the board of directors, or equivalents for non-corporate entities.",
        "enforcement_guidelines": [
            "Address the report to shareholders and the board of directors.",
            "Include additional addressees if applicable."
        ]
    },
    {
        "rule_id": "PCAOB-4105-37B",
        "standard": "AS 4105 - Reviews of Interim Financial Information",
        "description": "The first section of the review report must include specific elements such as the company name, reviewed financial information, and conformity with accounting principles.",
        "enforcement_guidelines": [
            "Include the company name in the reviewed financial information.",
            "State that the interim financial information was reviewed.",
            "Mention conformity with accounting principles, including country of origin."
        ]
    },
    {
        "rule_id": "PCAOB-4105-37C",
        "standard": "AS 4105 - Reviews of Interim Financial Information",
        "description": "The second section must include the responsibility of management, PCAOB standards compliance, procedures description, comparison to audit scope, and auditor registration.",
        "enforcement_guidelines": [
            "State that interim financial information is management's responsibility.",
            "Confirm review conducted per PCAOB standards.",
            "Describe review procedures.",
            "Compare review scope to audit scope.",
            "Mention auditor registration with PCAOB."
        ]
    },
    {
        "rule_id": "PCAOB-4105-37D",
        "standard": "AS 4105 - Reviews of Interim Financial Information",
        "description": "The review report must include the firm's signature, location, and date.",
        "enforcement_guidelines": [
            "Include the firm's signature.",
            "State the city and state (or country for non-U.S. auditors).",
            "Date the report upon completion of review procedures."
        ]
    },
    {
        "rule_id": "PCAOB-4105-41",
        "standard": "AS 4105 - Reviews of Interim Financial Information",
        "description": "The review report must be modified for departures from generally accepted accounting principles.",
        "enforcement_guidelines": [
            "Modify the report if material departures are found.",
            "Describe the nature of the departure.",
            "State the effect on interim financial information if practicable."
        ]
    },
    {
        "rule_id": "PCAOB-4105-43",
        "standard": "AS 4105 - Reviews of Interim Financial Information",
        "description": "The review report must be modified if necessary information for adequate disclosure is missing.",
        "enforcement_guidelines": [
            "Modify the report if necessary information is missing.",
            "Include the missing information in the report if practicable."
        ]
    },
    {
        "rule_id": "PCAOB-4105-01",
        "standard": "AS 4105 - Reviews of Interim Financial Information",
        "description": "Guidance for situations where a prior year's audit report included a going-concern paragraph, and conditions continue to exist.",
        "enforcement_guidelines": [
            "Assess whether conditions giving rise to substantial doubt about the entity's ability to continue as a going concern continue to exist.",
            "Ensure adequate and appropriate disclosure about these conditions in the interim financial information.",
            "Consider adding an explanatory paragraph to the review report if appropriate."
        ]
    },
    {
        "rule_id": "PCAOB-4105-02",
        "standard": "AS 4105 - Reviews of Interim Financial Information",
        "description": "Guidance for situations where conditions or events exist as of the interim reporting date that might indicate the entity's possible inability to continue as a going concern.",
        "enforcement_guidelines": [
            "Assess whether conditions or events exist that might indicate the entity's possible inability to continue as a going concern.",
            "Ensure adequate and appropriate disclosure about these conditions or events in the interim financial information.",
            "Consider adding an explanatory paragraph to the review report if appropriate."
        ]
    },
    {
        "rule_id": "PCAOB-4105-03",
        "standard": "AS 4105 - Reviews of Interim Financial Information",
        "description": "Guidance for situations where a client represents that the accountant has reviewed interim financial information included in a document filed with a regulatory agency or issued to stockholders or third parties.",
        "enforcement_guidelines": [
            "Advise the client that the accountant's review report must be included in the document.",
            "If the client does not agree to include the review report, request that the accountant's name be neither associated with the interim financial information nor referred to in the document.",
            "If the client does not comply with the request, advise the client that the accountant will not consent to the use of his or her name or reference to him or her."
        ]
    },
    {
        "rule_id": "PCAOB-4105-04",
        "standard": "AS 4105 - Reviews of Interim Financial Information",
        "description": "Guidance for documenting the review of interim financial information.",
        "enforcement_guidelines": [
            "Prepare documentation that includes findings or issues that are significant, such as results of review procedures that indicate the interim financial information could be materially misstated.",
            "Include actions taken to address such findings and the basis for the final conclusions reached.",
            "Ensure documentation includes the nature, timing, extent, and results of the review procedures performed.",
            "Identify the engagement team member(s) who performed and reviewed the work.",
            "Identify the evidence obtained in support of the conclusion that the interim financial information being reviewed agreed or reconciled with the accounting records."
        ]
    },
    {
        "rule_id": "PCAOB-4105-1",
        "standard": "AS 4105 - Reviews of Interim Financial Information",
        "description": "Management representation letter for a review of interim financial information, confirming the preparation and presentation of interim financial statements in conformity with generally accepted accounting principles.",
        "enforcement_guidelines": [
            "Confirm that the interim financial information has been prepared and presented in conformity with generally accepted accounting principles applicable to interim financial information.",
            "Confirm that all financial records and related data, including names of all related parties and all relationships and transactions with related parties, have been made available to the accountant.",
            "Confirm that all minutes of the meetings of stockholders, directors, and committees of directors, or summaries of actions of recent meetings for which minutes have not yet been prepared, have been made available to the accountant.",
            "Confirm that the effects of any uncorrected financial statement misstatements aggregated by the accountant during the current review engagement and pertaining to the interim period(s) in the current year are immaterial, both individually and in the aggregate, to the interim financial information taken as a whole.",
            "Confirm that there are no significant deficiencies, including material weaknesses, in the design or operation of internal controls which could adversely affect the company's ability to record, process, summarize, and report interim financial data.",
            "Confirm that management acknowledges their responsibility for the design and implementation of programs and controls to prevent and detect fraud.",
            "Confirm that management has no knowledge of any fraud or suspected fraud affecting the company involving management, employees who have significant roles in internal control, or others where the fraud could have a material effect on the interim financial information.",
            "Confirm that management has no knowledge of any allegations of fraud or suspected fraud affecting the company in communications from employees, former employees, analysts, regulators, short sellers, or others."
        ]
    },
    {
        "rule_id": "PCAOB-4105-2",
        "standard": "AS 4105 - Reviews of Interim Financial Information",
        "description": "Detailed management representation letter for a review of interim financial information, confirming the preparation and presentation of interim financial statements in conformity with generally accepted accounting principles.",
        "enforcement_guidelines": [
            "Confirm that the interim financial information has been prepared and presented in conformity with generally accepted accounting principles applicable to interim financial information.",
            "Confirm that all financial records and related data, including names of all related parties and all relationships and transactions with related parties, have been made available to the accountant.",
            "Confirm that all minutes of the meetings of stockholders, directors, and committees of directors, or summaries of actions of recent meetings for which minutes have not yet been prepared, have been made available to the accountant.",
            "Confirm that there have been no communications from regulatory agencies concerning noncompliance with or deficiencies in financial reporting practices.",
            "Confirm that there are no material transactions that have not been properly recorded in the accounting records underlying the interim financial information.",
            "Confirm that the effects of any uncorrected financial statement misstatements aggregated by the accountant during the current review engagement and pertaining to the interim period(s) in the current year are immaterial, both individually and in the aggregate, to the interim financial information taken as a whole."
        ]
    },
    {
        "rule_id": "PCAOB-4105-01",
        "standard": "AS 4105 - Reviews of Interim Financial Information",
        "description": "Ensures that there are no significant deficiencies in internal controls affecting the interim financial data.",
        "enforcement_guidelines": [
            "Assess the design and operation of internal controls related to interim financial information.",
            "Identify and document any significant deficiencies or material weaknesses.",
            "Communicate findings to management and the audit committee."
        ]
    },
    {
        "rule_id": "PCAOB-4105-02",
        "standard": "AS 4105 - Reviews of Interim Financial Information",
        "description": "Requires management to represent that they have no knowledge of fraud affecting the company.",
        "enforcement_guidelines": [
            "Obtain written representations from management regarding fraud.",
            "Evaluate the sufficiency and reliability of these representations.",
            "Document the evaluation and any follow-up actions."
        ]
    },
    {
        "rule_id": "PCAOB-4105-03",
        "standard": "AS 4105 - Reviews of Interim Financial Information",
        "description": "Ensures that all uncorrected misstatements are properly recorded or disclosed.",
        "enforcement_guidelines": [
            "Identify and summarize all uncorrected misstatements.",
            "Ensure proper recording or disclosure of these misstatements.",
            "Provide the schedule of uncorrected misstatements to the audit committee."
        ]
    },
    {
        "rule_id": "PCAOB-4105-04",
        "standard": "AS 4105 - Reviews of Interim Financial Information",
        "description": "Requires management to represent that they have no knowledge of any fraud involving key personnel.",
        "enforcement_guidelines": [
            "Obtain written representations from management regarding fraud involving key personnel.",
            "Evaluate the sufficiency and reliability of these representations.",
            "Document the evaluation and any follow-up actions."
        ]
    },
    {
        "rule_id": "PCAOB-4105-05",
        "standard": "AS 4105 - Reviews of Interim Financial Information",
        "description": "Ensures that management represents that they have no knowledge of any allegations of fraud.",
        "enforcement_guidelines": [
            "Obtain written representations from management regarding allegations of fraud.",
            "Evaluate the sufficiency and reliability of these representations.",
            "Document the evaluation and any follow-up actions."
        ]
    },
    {
        "rule_id": "PCAOB-4105-06",
        "standard": "AS 4105 - Reviews of Interim Financial Information",
        "description": "Ensures that the company has satisfactory title to all owned assets and no liens or encumbrances.",
        "enforcement_guidelines": [
            "Verify ownership of all assets.",
            "Check for any liens or encumbrances on assets.",
            "Document findings and communicate any issues to management."
        ]
    },
    {
        "rule_id": "PCAOB-6101",
        "standard": "AS 6101 - Letters for Underwriters and Certain Other Requesting Parties",
        "description": "Guidance for accountants issuing comfort letters to underwriters and other requesting parties in securities offerings.",
        "enforcement_guidelines": [
            "Ensure the requesting party provides a written representation letter stating that the review process is consistent with what would be performed if the offering were registered under the Securities Act of 1933.",
            "Include specific disclaimers in the comfort letter regarding the scope of the review and the lack of responsibility for legal interpretations.",
            "Ensure the comfort letter includes statements about the limited scope of the review and the lack of responsibility for updating the letter after the cutoff date.",
            "Do not provide a comfort letter to parties not described in paragraphs .03, .04, or .05; instead, provide a report on agreed-upon procedures as per AT section 201."
        ]
    },
    {
        "rule_id": "PCAOB-6101-1",
        "standard": "AS 6101 - Letters for Underwriters and Certain Other Requesting Parties",
        "description": "Accountants may not issue any additional letters or reports under any other section in connection with the offering or placement of securities, in which the accountants comment on items for which commenting is otherwise precluded by this section.",
        "enforcement_guidelines": [
            "Ensure that only the comfort letter as per AS 6101 is provided in connection with the offering.",
            "Avoid issuing any other letters or reports that comment on items precluded by this standard.",
            "If additional information is requested, address it within the scope of the comfort letter."
        ]
    },
    {
        "rule_id": "PCAOB-6101-2",
        "standard": "AS 6101 - Letters for Underwriters and Certain Other Requesting Parties",
        "description": "Accountants may not issue any additional letters or reports under any other section in connection with the offering or placement of securities, in which the accountants comment on items for which commenting is otherwise precluded by this section.",
        "enforcement_guidelines": [
            "Ensure that only the comfort letter as per AS 6101 is provided in connection with the offering.",
            "Avoid issuing any other letters or reports that comment on items precluded by this standard.",
            "If additional information is requested, address it within the scope of the comfort letter."
        ]
    },
    {
        "rule_id": "PCAOB-6101-01",
        "standard": "AS 6101 - Letters for Underwriters and Certain Other Requesting Parties",
        "description": "Guidance on handling explanatory paragraphs in comfort letters.",
        "enforcement_guidelines": [
            "Refer to explanatory paragraphs in the comfort letter.",
            "Discuss the subject matter of the paragraphs."
        ]
    },
    {
        "rule_id": "PCAOB-6101-02",
        "standard": "AS 6101 - Letters for Underwriters and Certain Other Requesting Parties",
        "description": "Procedures for commenting on unaudited interim financial information.",
        "enforcement_guidelines": [
            "Perform procedures in accordance with AS 4105.",
            "State in the comfort letter if procedures were performed.",
            "Attach the review report if not already included."
        ]
    },
    {
        "rule_id": "PCAOB-6101-03",
        "standard": "AS 6101 - Letters for Underwriters and Certain Other Requesting Parties",
        "description": "Guidance on stating independence in comfort letters.",
        "enforcement_guidelines": [
            "State independence within the meaning of the Act and SEC rules.",
            "Specify the date of independence statement."
        ]
    },
    {
        "rule_id": "PCAOB-6101-04",
        "standard": "AS 6101 - Letters for Underwriters and Certain Other Requesting Parties",
        "description": "Guidance on providing assurance on compliance with SEC requirements.",
        "enforcement_guidelines": [
            "Provide positive assurance if financial statements were audited.",
            "Provide negative assurance if financial statements were not audited."
        ]
    },
    {
        "rule_id": "PCAOB-6101-05",
        "standard": "AS 6101 - Letters for Underwriters and Certain Other Requesting Parties",
        "description": "Conditions for providing negative assurance on unaudited information.",
        "enforcement_guidelines": [
            "Ensure knowledge of internal control over financial reporting.",
            "Perform procedures in accordance with AS 4105.",
            "State that findings are based on the specified procedures."
        ]
    },
    {
        "rule_id": "PCAOB-6101-01",
        "standard": "AS 6101 - Letters for Underwriters and Certain Other Requesting Parties",
        "description": "Accountants may provide negative assurance on capsule financial information if it meets specific conditions, including minimum disclosure requirements and an AS 4105 review.",
        "enforcement_guidelines": [
            "Verify that capsule financial information meets the minimum disclosure requirements of APB Opinion No. 28.",
            "Conduct an AS 4105 review of the underlying financial statements.",
            "If conditions are not met, limit comments to procedures performed and findings obtained."
        ]
    },
    {
        "rule_id": "PCAOB-6101-02",
        "standard": "AS 6101 - Letters for Underwriters and Certain Other Requesting Parties",
        "description": "Accountants may provide negative assurance on subsequent changes in financial statement items only if the cutoff date is within 135 days of the latest audited period.",
        "enforcement_guidelines": [
            "Determine if the cutoff date is within 135 days of the latest audited period.",
            "If within the timeframe, provide negative assurance on subsequent changes.",
            "If beyond the timeframe, limit comments to procedures performed and findings obtained."
        ]
    },
    {
        "rule_id": "PCAOB-6101-03",
        "standard": "AS 6101 - Letters for Underwriters and Certain Other Requesting Parties",
        "description": "Accountants should only comment on financial information derived from accounting records subject to internal controls and avoid assurance on non-financial data.",
        "enforcement_guidelines": [
            "Comment only on information expressed in dollars or derived from accounting records under internal controls.",
            "Avoid providing assurance on non-financial data such as square footage or employee counts.",
            "Clearly state the basis of the comments to avoid implying broader assurance."
        ]
    },
    {
        "rule_id": "PCAOB-6101",
        "standard": "AS 6101 - Letters for Underwriters and Certain Other Requesting Parties",
        "description": "This standard outlines the requirements for accountants' letters (comfort letters) provided to underwriters and other requesting parties in connection with securities offerings. It specifies the information to be included in such letters, the procedures to be performed, and the manner in which findings are communicated.",
        "enforcement_guidelines": [
            "State the independence of the accountants with respect to the company.",
            "Provide negative assurance on the conformity of unaudited interim financial information with the applicable accounting requirements of the Securities Act of 1933 and related rules and regulations.",
            "State the inability to express an opinion on unaudited interim financial information.",
            "Describe the procedures performed to review the unaudited interim financial information.",
            "Communicate findings and any material changes in the financial statements or other relevant matters.",
            "Include a concluding paragraph specifying the purpose and limitations of the comfort letter."
        ]
    },
    {
        "rule_id": "PCAOB-6101",
        "standard": "AS 6101 - Letters for Underwriters and Certain Other Requesting Parties",
        "description": "Guidelines for auditors to provide letters of comfort to underwriters and other requesting parties, outlining the procedures and representations made regarding financial statements and related matters.",
        "enforcement_guidelines": [
            "Confirm independence with respect to the company and its subsidiaries.",
            "Review the unaudited consolidated financial statements for specific periods and inquire about their consistency with audited statements.",
            "Inquire about the basis of unaudited financial statements and their compliance with applicable accounting requirements.",
            "Check for any material modifications needed to ensure unaudited statements conform to generally accepted accounting principles.",
            "Verify that unaudited financial statements do not have material inconsistencies with previously audited statements.",
            "Assess changes in capital stock, long-term debt, net current assets, or stockholders' equity compared to prior periods.",
            "Evaluate decreases in net sales, income before extraordinary items, or net income compared to the corresponding period in the prior year.",
            "Ensure that any changes, increases, or decreases are disclosed in the registration statement."
        ]
    },
    {
        "rule_id": "PCAOB-6101-D",
        "standard": "AS 6101 - Letters for Underwriters and Certain Other Requesting Parties",
        "description": "Commenting on pro forma financial information in a registration statement.",
        "enforcement_guidelines": [
            "Read the unaudited pro forma condensed consolidated balance sheet and statements of income and cash flows.",
            "Inquire of company officials about the application of pro forma adjustments.",
            "Prove the arithmetic accuracy of the application of pro forma adjustments to historical amounts."
        ]
    },
    {
        "rule_id": "PCAOB-6101-E",
        "standard": "AS 6101 - Letters for Underwriters and Certain Other Requesting Parties",
        "description": "Commenting on a financial forecast in a registration statement.",
        "enforcement_guidelines": [
            "Read the forecasted consolidated balance sheet and statements of income and cash flows.",
            "Compare the forecasted amounts with the company's accounting records.",
            "Prove the arithmetic accuracy of the forecasted amounts."
        ]
    },
    {
        "rule_id": "PCAOB-6101-F",
        "standard": "AS 6101 - Letters for Underwriters and Certain Other Requesting Parties",
        "description": "Commenting on tables, statistics, and other financial information in a registration statement.",
        "enforcement_guidelines": [
            "Read the specified tables, statistics, and other financial information.",
            "Compare the information with the company's accounting records.",
            "Verify the arithmetic accuracy of the information.",
            "Inquire of company officials about compliance with applicable regulations."
        ]
    },
    {
        "rule_id": "PCAOB-6101",
        "standard": "AS 6101 - Letters for Underwriters and Certain Other Requesting Parties",
        "description": "Guidelines for auditors when providing letters to underwriters and other requesting parties regarding financial information in registration statements.",
        "enforcement_guidelines": [
            "Read and understand the specified sections of the registration statement and related financial information.",
            "Perform audit procedures to verify the accuracy and consistency of the financial data presented.",
            "Compare the financial information with audited financial statements, unaudited financial statements, or other reliable sources.",
            "Inquire of company officials regarding the sufficiency of disclosure and the accuracy of the financial information.",
            "Ensure that the letter is not used for any purpose other than assisting underwriters in their investigation of the company's affairs."
        ]
    },
    {
        "rule_id": "PCAOB-6101I",
        "standard": "AS 6101 - Letters for Underwriters and Certain Other Requesting Parties",
        "description": "Guidelines for revising the introductory paragraph when the audit report includes an explanatory paragraph about a lawsuit.",
        "enforcement_guidelines": [
            "Revise the introductory paragraph to reference the explanatory paragraph regarding the lawsuit.",
            "Mention that the matter is discussed in Note 8 to the consolidated financial statements."
        ]
    },
    {
        "rule_id": "PCAOB-6101J",
        "standard": "AS 6101 - Letters for Underwriters and Certain Other Requesting Parties",
        "description": "Guidelines for revising the introductory paragraph when the SEC has agreed to a departure from their accounting requirements.",
        "enforcement_guidelines": [
            "Revise paragraph 2 to include the phrase 'as agreed to by representatives of the SEC.'",
            "Mention the specific departure, such as omitting separate financial statements of an equity investee."
        ]
    },
    {
        "rule_id": "PCAOB-6101K",
        "standard": "AS 6101 - Letters for Underwriters and Certain Other Requesting Parties",
        "description": "Guidelines for revising paragraphs 4, 5, and 6 when recent earnings data is presented in capsule form.",
        "enforcement_guidelines": [
            "Revise paragraph 4 to include procedures for reviewing interim financial information.",
            "Revise paragraph 5 to address the sufficiency of procedures for the requesting party's purposes.",
            "Revise paragraph 6 to include inquiries about changes in financial statement items."
        ]
    },
    {
        "rule_id": "PCAOB-6101L",
        "standard": "AS 6101 - Letters for Underwriters and Certain Other Requesting Parties",
        "description": "Guidelines for revising paragraph 5b when accountants are aware of a decrease in a financial statement item.",
        "enforcement_guidelines": [
            "Revise paragraph 5b to address the decrease in consolidated net current assets.",
            "Include specific financial data showing the decrease."
        ]
    },
    {
        "rule_id": "PCAOB-6101M",
        "standard": "AS 6101 - Letters for Underwriters and Certain Other Requesting Parties",
        "description": "Guidelines for revising paragraph 5b when accountants are aware of a decrease in a financial statement item.",
        "enforcement_guidelines": [
            "Revise paragraph 5b to address the decrease in consolidated net current assets.",
            "Include specific financial data showing the decrease."
        ]
    },
    {
        "rule_id": "PCAOB-6101-4b(i)",
        "standard": "AS 6101 - Letters for Underwriters and Certain Other Requesting Parties",
        "description": "Reading and agreeing unaudited condensed consolidated financial statements with accounting records.",
        "enforcement_guidelines": [
            "Read the unaudited condensed consolidated balance sheet as of March 31, 19X6, and the unaudited condensed consolidated statements of income, retained earnings (stockholders' equity), and cash flows for the three-month periods ended March 31, 19X6 and 19X5, included in the registration statement.",
            "Agree the amounts contained therein with the company's accounting records as of March 31, 19X6 and 19X5, and for the three-month periods then ended."
        ]
    },
    {
        "rule_id": "PCAOB-6101-4b(ii)",
        "standard": "AS 6101 - Letters for Underwriters and Certain Other Requesting Parties",
        "description": "Inquiring about conformity with GAAP and compliance with accounting requirements.",
        "enforcement_guidelines": [
            "Inquire of certain officials of the company who have responsibility for financial and accounting matters whether the unaudited condensed consolidated financial statements referred to in 4b(i) are stated on a basis substantially consistent with that of the audited consolidated financial statements included in the registration statement.",
            "Inquire whether at May 31, 19X6, there was any change in the capital stock, increase in long-term debt, or any decrease in consolidated net current assets or stockholders' equity of the consolidated companies as compared with amounts shown on the March 31, 19X6, unaudited condensed consolidated balance sheet included in the registration statement.",
            "Inquire whether for the period from April 1, 19X6, to May 31, 19X6, there were any decreases, as compared with the corresponding period in the preceding year, in consolidated net sales or in the total or per-share amounts of income before extraordinary items or of net income."
        ]
    },
    {
        "rule_id": "PCAOB-6101-4c",
        "standard": "AS 6101 - Letters for Underwriters and Certain Other Requesting Parties",
        "description": "Inquiring about changes in financial statement items after May 31, 19X6.",
        "enforcement_guidelines": [
            "Inquire of certain officials of the company who have responsibility for financial and accounting matters whether (a) at June 23, 19X6, there was any change in the capital stock, increase in long-term debt, or any decrease in consolidated net current assets or stockholders' equity of the consolidated companies as compared with amounts shown on the March 31, 19X6, unaudited condensed consolidated balance sheet included in the registration statement, or (b) for the period from April 1, 19X6, to June 23, 19X6, there were any decreases, as compared with the corresponding period in the preceding year, in consolidated net sales or in the total or per-share amounts of income before extraordinary items or of net income."
        ]
    },
    {
        "rule_id": "PCAOB-6101",
        "standard": "AS 6101 - Letters for Underwriters and Certain Other Requesting Parties",
        "description": "Guidelines for auditors when issuing letters to underwriters and other requesting parties, including the scope of procedures performed and the limitations of such letters.",
        "enforcement_guidelines": [
            "Compare financial information in offering documents with audited financial statements to ensure agreement.",
            "Inquire of company officials regarding the consistency of unaudited financial statements with generally accepted accounting principles.",
            "Perform specific audit procedures and document the scope and limitations of the work performed.",
            "Clearly state that the procedures performed do not constitute an audit and that no opinion is expressed on the sufficiency of the procedures for the requesting party's purposes."
        ]
    },
    {
        "rule_id": "PCAOB-6101",
        "standard": "AS 6101 - Letters for Underwriters and Certain Other Requesting Parties",
        "description": "Guidelines for accountants when providing comfort letters to underwriters, including procedures for inquiring about compliance with accounting requirements, detecting changes in financial statements, and providing negative assurance on interim financial information.",
        "enforcement_guidelines": [
            "Inquire of company officials regarding compliance of unaudited financial statements with applicable accounting requirements of the Act and related SEC rules and regulations.",
            "Perform procedures to detect changes in financial statements, including changes in capital stock, long-term debt, net current assets, stockholders' equity, net sales, income before extraordinary items, and net income.",
            "Provide negative assurance on interim financial information if a review has been performed, stating that nothing came to the accountants' attention that caused them to believe that the interim financial information does not conform with generally accepted accounting principles."
        ]
    },
    {
        "rule_id": "PCAOB-6105-03",
        "standard": "AS 6105 - Reports on the Application of Accounting Principles",
        "description": "Guidance for reporting accountants on the purpose of their report and the procedures to be followed.",
        "enforcement_guidelines": [
            "Understand the form and substance of the transaction(s)",
            "Review applicable accounting principles",
            "Consult with other professionals or experts if appropriate",
            "Perform research or other procedures to ascertain and consider the existence of credible precedents or analogies"
        ]
    },
    {
        "rule_id": "PCAOB-6105-04",
        "standard": "AS 6105 - Reports on the Application of Accounting Principles",
        "description": "Prohibition on engagements involving hypothetical transactions.",
        "enforcement_guidelines": [
            "Do not undertake an engagement to provide a written report on the application of accounting principles to a hypothetical transaction",
            "Advise the client of the prohibition and the reasons therefor"
        ]
    },
    {
        "rule_id": "PCAOB-6105-07",
        "standard": "AS 6105 - Reports on the Application of Accounting Principles",
        "description": "Performance standards for reporting accountants.",
        "enforcement_guidelines": [
            "Exercise due professional care in performing the engagement",
            "Plan the engagement adequately",
            "Supervise the work of assistants, if any",
            "Accumulate sufficient information to provide a reasonable basis for the professional judgment described in the report"
        ]
    },
    {
        "rule_id": "PCAOB-6105-08",
        "standard": "AS 6105 - Reports on the Application of Accounting Principles",
        "description": "Procedures for evaluating accounting principles.",
        "enforcement_guidelines": [
            "Obtain an understanding of the form and substance of the transaction(s)",
            "Review applicable accounting principles",
            "Consult with other professionals or experts if appropriate",
            "Perform research or other procedures to ascertain and consider the existence of credible precedents or analogies"
        ]
    },
    {
        "rule_id": "PCAOB-6105-09",
        "standard": "AS 6105 - Reports on the Application of Accounting Principles",
        "description": "Guidance for evaluating accounting principles and consulting with the continuing accountant.",
        "enforcement_guidelines": [
            "Consult with the continuing accountant of the entity to ascertain all the available facts relevant to forming a professional judgment",
            "Obtain information regarding the form and substance of the transaction",
            "Consider how management has applied accounting principles to similar transactions",
            "Consider whether the method of accounting recommended by the continuing accountant is disputed by management",
            "Consider the impact of the information obtained on the report"
        ]
    },
    {
        "rule_id": "PCAOB-6105",
        "standard": "AS 6105 - Reports on the Application of Accounting Principles",
        "description": "Guidelines for reporting on the application of accounting principles, including the structure and content of written reports.",
        "enforcement_guidelines": [
            "Include a brief description of the engagement and compliance with PCAOB standards.",
            "Identify the specific entity, describe the transaction, and state relevant facts, circumstances, and assumptions.",
            "State the appropriate accounting principles and the reasons for the conclusion.",
            "Include a statement on the responsibility of financial statement preparers.",
            "Include a restricted use paragraph specifying the intended users of the report."
        ]
    },
    {
        "rule_id": "PCAOB-6110",
        "standard": "AS 6110 - Compliance Auditing Considerations in Audits of Recipients of Governmental Financial Assistance",
        "description": "Guidance for auditors on compliance with laws and regulations in audits of governmental entities and recipients of financial assistance.",
        "enforcement_guidelines": [
            "Understand the effects of laws and regulations on financial statements.",
            "Assess management's identification of applicable laws and regulations.",
            "Design the audit to detect material misstatements due to violations of laws and regulations.",
            "Obtain an understanding of the effects of laws and regulations on financial statements."
        ]
    },
    {
        "rule_id": "PCAOB-6110-1",
        "standard": "AS 6110 - Compliance Auditing Considerations in Audits of Recipients of Governmental Financial Assistance",
        "description": "Auditors must assess compliance with laws and regulations affecting federal financial assistance programs and report on compliance with applicable requirements.",
        "enforcement_guidelines": [
            "Consider knowledge about such laws and regulations obtained from prior years' audits.",
            "Discuss such laws and regulations with the entity's chief financial officer, legal counsel, or grant administrators.",
            "Obtain written representation from management regarding the completeness of management's identification of applicable laws and regulations.",
            "Review the relevant portions of any directly related agreements, such as those related to grants and loans.",
            "Evaluate the effect of identified instances of noncompliance on each major federal financial assistance program."
        ]
    },
    {
        "rule_id": "PCAOB-6110-2",
        "standard": "AS 6110 - Compliance Auditing Considerations in Audits of Recipients of Governmental Financial Assistance",
        "description": "Auditors must communicate with management and the audit committee if an audit in accordance with PCAOB standards may not satisfy other legal, regulatory, or contractual requirements.",
        "enforcement_guidelines": [
            "Communicate to management and the audit committee if an audit in accordance with PCAOB standards may not satisfy other legal, regulatory, or contractual requirements.",
            "Document the communication in the working papers if the communication is oral.",
            "Consider how the client's actions in response to such communication relate to other aspects of the audit, including the potential effect on the financial statements and on the auditor's report on those financial statements."
        ]
    },
    {
        "rule_id": "PCAOB-6115",
        "standard": "AS 6115 - Reporting on Whether a Previously Reported Material Weakness Continues to Exist",
        "description": "This standard establishes requirements and provides direction for auditors when engaged to report on whether a previously reported material weakness in internal control over financial reporting continues to exist as of a date specified by management.",
        "enforcement_guidelines": [
            "The auditor must obtain reasonable assurance about whether the previously reported material weakness exists as of the specified date.",
            "The auditor must evaluate evidence about the design and operating effectiveness of the specified controls as of the specified date.",
            "The auditor must ensure that management has accepted responsibility for the effectiveness of internal control over financial reporting.",
            "The auditor must verify that management has evaluated the effectiveness of the specific control(s) addressing the material weakness using the same control criteria as their most recent annual assessment.",
            "The auditor must confirm that management has provided sufficient evidence, including documentation, to support their assertion about the effectiveness of the controls."
        ]
    },
    {
        "rule_id": "PCAOB-6115",
        "standard": "AS 6115 - Reporting on Whether a Previously Reported Material Weakness Continues to Exist",
        "description": "This standard outlines the requirements for auditors to report on whether a previously reported material weakness in a company's internal control over financial reporting continues to exist.",
        "enforcement_guidelines": [
            "The auditor must obtain sufficient appropriate evidence about the design and operating effectiveness of specified controls that provide reasonable assurance that the company's stated control objective(s) are achieved.",
            "The auditor must evaluate management's evidence supporting its assertion that the material weakness no longer exists.",
            "The auditor must determine whether management has selected an appropriate date for its assertion and whether the specified date permits the auditor to obtain sufficient evidence supporting his or her opinion.",
            "The auditor must test the operating effectiveness of the specified controls over a period of time that is adequate to determine whether, as of the date specified in management's assertion, the controls necessary for achieving the stated control objective are operating effectively.",
            "The auditor must evaluate whether to use the work performed by others in the engagement and determine the extent to which the auditor may use the work of others to alter the nature, timing, or extent of the work the auditor otherwise would have performed."
        ]
    },
    {
        "rule_id": "PCAOB-6115-01",
        "standard": "AS 6115 - Reporting on Whether a Previously Reported Material Weakness Continues to Exist",
        "description": "The auditor must evaluate whether a previously reported material weakness continues to exist by assessing the effectiveness of specified controls and obtaining sufficient evidence to support management's assertion.",
        "enforcement_guidelines": [
            "Evaluate the sufficiency of evidence obtained from all sources, including management's assertions and the results of the auditor's evaluation of the design and operating effectiveness of the specified controls.",
            "Use the work of others only if it provides a tangible benefit and the degree of competence and objectivity of the individuals performing the work is high.",
            "Perform walkthroughs to assess the operating effectiveness of the specified controls."
        ]
    },
    {
        "rule_id": "PCAOB-6115-02",
        "standard": "AS 6115 - Reporting on Whether a Previously Reported Material Weakness Continues to Exist",
        "description": "The lead auditor must not divide responsibility for the engagement with another accounting firm.",
        "enforcement_guidelines": [
            "Ensure that the lead auditor retains full responsibility for the engagement.",
            "Document the lead auditor's accountability for the engagement and any related decisions."
        ]
    },
    {
        "rule_id": "PCAOB-6115-03",
        "standard": "AS 6115 - Reporting on Whether a Previously Reported Material Weakness Continues to Exist",
        "description": "Management must provide written representations regarding their responsibility for internal control over financial reporting and the effectiveness of specified controls.",
        "enforcement_guidelines": [
            "Obtain written representations from management acknowledging their responsibility for establishing and maintaining effective internal control over financial reporting.",
            "Ensure that management's representations include statements regarding the effectiveness of the specified controls and the assertion that the material weakness no longer exists."
        ]
    },
    {
        "rule_id": "PCAOB-6115-04",
        "standard": "AS 6115 - Reporting on Whether a Previously Reported Material Weakness Continues to Exist",
        "description": "Management's report must include specific elements such as statements of responsibility, control criteria, identification of the material weakness, and the assertion that it no longer exists.",
        "enforcement_guidelines": [
            "Verify that management's report includes a statement of responsibility for internal control over financial reporting.",
            "Ensure that the report identifies the control criteria used by management to conduct the evaluation.",
            "Confirm that the report includes the identification of the material weakness and the assertion that it no longer exists."
        ]
    },
    {
        "rule_id": "PCAOB-6115-05",
        "standard": "AS 6115 - Reporting on Whether a Previously Reported Material Weakness Continues to Exist",
        "description": "The auditor's report must include specific elements such as the title, description of the material weakness, management's assertion, and the auditor's opinion.",
        "enforcement_guidelines": [
            "Include the word 'independent' in the title of the auditor's report.",
            "Describe the material weakness identified in the auditor's previous report.",
            "Identify management's assertion that the material weakness no longer exists.",
            "State that management is responsible for its assertion.",
            "Express an opinion on whether the material weakness continues to exist as of the date of management's assertion."
        ]
    },
    {
        "rule_id": "PCAOB-6115-1",
        "standard": "AS 6115 - Reporting on Whether a Previously Reported Material Weakness Continues to Exist",
        "description": "Requirements for the auditor's report on whether a previously reported material weakness continues to exist.",
        "enforcement_guidelines": [
            "Include a statement that the engagement was conducted in accordance with PCAOB standards.",
            "State that the auditor was not engaged to audit internal control over financial reporting.",
            "State that the auditor does not express an opinion on the effectiveness of internal control over financial reporting.",
            "State that the auditor does not express an opinion on any other controls.",
            "State that the auditor's report is limited to the matters described in the report."
        ]
    },
    {
        "rule_id": "PCAOB-6115-2",
        "standard": "AS 6115 - Reporting on Whether a Previously Reported Material Weakness Continues to Exist",
        "description": "Requirements for the auditor's responsibilities when a material weakness continues to exist.",
        "enforcement_guidelines": [
            "If the auditor concludes that a material weakness continues to exist, the auditor must express an opinion that the material weakness exists as of the date specified by management.",
            "If the auditor does not issue a report in this circumstance, the auditor must communicate, in writing, his or her conclusion that a material weakness continues to exist to the audit committee.",
            "The auditor must consider that conclusion as part of his or her evaluation of management's quarterly disclosures about internal control over financial reporting, as required by AS 4105.07 and AS 4105.29-.32."
        ]
    },
    {
        "rule_id": "PCAOB-6115",
        "standard": "AS 6115 - Reporting on Whether a Previously Reported Material Weakness Continues to Exist",
        "description": "This standard addresses the auditor's responsibility to report on whether a previously reported material weakness in internal control over financial reporting continues to exist. It provides guidance on the auditor's procedures, including obtaining an understanding of the company's internal control over financial reporting, examining evidence supporting management's assertion, and performing other necessary procedures.",
        "enforcement_guidelines": [
            "Identify and assess the previously reported material weakness in internal control over financial reporting.",
            "Obtain an understanding of the company's internal control over financial reporting as part of the previous audit and update that understanding as it relates to changes in internal control over financial reporting associated with the material weakness.",
            "Examine evidence supporting management's assertion that the material weakness no longer exists.",
            "Perform other procedures as necessary to obtain reasonable assurance about whether the previously reported material weakness continues to exist.",
            "Express an opinion on whether the identified material weakness continues to exist as of the specified date."
        ]
    }
]